<?xml version="1.0" encoding="utf-8" standalone="yes" ?>
<rss version="2.0" xmlns:atom="http://www.w3.org/2005/Atom">
  <channel>
    <title>Neptune | my opinion is my own 👋</title>
    <link>/tag/neptune/</link>
      <atom:link href="/tag/neptune/index.xml" rel="self" type="application/rss+xml" />
    <description>Neptune</description>
    <generator>Wowchemy (https://wowchemy.com)</generator><language>en-us</language><lastBuildDate>Fri, 22 Jan 2021 00:00:00 +0000</lastBuildDate>
    <image>
      <url>/media/icon_hu0b7a4cb9992c9ac0e91bd28ffd38dd00_9727_512x512_fill_lanczos_center_3.png</url>
      <title>Neptune</title>
      <link>/tag/neptune/</link>
    </image>
    
    <item>
      <title>AuroraとNeptuneのメンテナンス（パッチ適用）について</title>
      <link>/aws-aurora-neptune-maintenance-about.html</link>
      <pubDate>Fri, 22 Jan 2021 00:00:00 +0000</pubDate>
      <guid>/aws-aurora-neptune-maintenance-about.html</guid>
      <description>&lt;h1 id=&#34;はじめに&#34;&gt;はじめに&lt;/h1&gt;
&lt;p&gt;RDSのメンテナンスの種類は「Available(利用可能) 」と「Required(必須) 」の種類が存在する。Aurora(PostgreSQL)とNeptuneにそれぞれAvailableとRequiredのパッチがあったので確認してみる。&lt;/p&gt;
&lt;p&gt;NeptuneはRDSのと運用周りは同じな模様。（全てが一緒というわけではないと思うが。）&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;a href=&#34;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/limits.html&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/limits.html&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;gt; 特定の管理機能のために、Amazon Neptune は Amazon Relational Database Service (Amazon RDS) と共有の運用テクノロジーを使用します。&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h4 id=&#34;neptune&#34;&gt;Neptune&lt;/h4&gt;
&lt;p&gt;















&lt;figure  &gt;
  &lt;div class=&#34;d-flex justify-content-center&#34;&gt;
    &lt;div class=&#34;w-100&#34; &gt;&lt;img alt=&#34;image-20200502105158178&#34; srcset=&#34;
               /image-20200502105158178_hu90476d6647420c2d91b2e44e6fbb8661_27094_9fc7a8a2020c397f7d36a40ca0b569f5.png 400w,
               /image-20200502105158178_hu90476d6647420c2d91b2e44e6fbb8661_27094_1e027a9684e6810dc1bc52cb43f49c2b.png 760w,
               /image-20200502105158178_hu90476d6647420c2d91b2e44e6fbb8661_27094_1200x1200_fit_lanczos_3.png 1200w&#34;
               src=&#34;/image-20200502105158178_hu90476d6647420c2d91b2e44e6fbb8661_27094_9fc7a8a2020c397f7d36a40ca0b569f5.png&#34;
               width=&#34;760&#34;
               height=&#34;147&#34;
               loading=&#34;lazy&#34; data-zoomable /&gt;&lt;/div&gt;
  &lt;/div&gt;&lt;/figure&gt;
&lt;/p&gt;
&lt;h4 id=&#34;aurora&#34;&gt;Aurora&lt;/h4&gt;
&lt;p&gt;















&lt;figure  &gt;
  &lt;div class=&#34;d-flex justify-content-center&#34;&gt;
    &lt;div class=&#34;w-100&#34; &gt;&lt;img alt=&#34;image-20200502105100980&#34; srcset=&#34;
               /image-20200502105100980_hudbd2722adfea1cb7a15445b3308122fc_36211_3bbdc3d45633a9ff719918588c6ba725.png 400w,
               /image-20200502105100980_hudbd2722adfea1cb7a15445b3308122fc_36211_3c9fd2962b02a33fa19ac757bad90447.png 760w,
               /image-20200502105100980_hudbd2722adfea1cb7a15445b3308122fc_36211_1200x1200_fit_lanczos_3.png 1200w&#34;
               src=&#34;/image-20200502105100980_hudbd2722adfea1cb7a15445b3308122fc_36211_3bbdc3d45633a9ff719918588c6ba725.png&#34;
               width=&#34;760&#34;
               height=&#34;131&#34;
               loading=&#34;lazy&#34; data-zoomable /&gt;&lt;/div&gt;
  &lt;/div&gt;&lt;/figure&gt;
&lt;/p&gt;
&lt;h1 id=&#34;available利用可能-とrequired必須-について&#34;&gt;Available(利用可能) とRequired(必須) について&lt;/h1&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;必須&lt;/strong&gt; – メンテナンスアクションがリソースに適用され、延期はできません。&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;利用可能&lt;/strong&gt; – メンテナンスアクションは利用可能ですが、自動的にはリソースに適用されません。手動で適用できます。&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&#34;describependingmaintenanceactions-api&#34;&gt;DescribePendingMaintenanceActions API&lt;/h3&gt;
&lt;p&gt;メンテナンスについては&lt;a href=&#34;http://docs.aws.amazon.com/AmazonRDS/latest/APIReference/API_DescribePendingMaintenanceActions.html&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;DescribePendingMaintenanceActions API&lt;/a&gt;から確認することが出来る。&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;[ec2-user@bastin ~]$ aws rds describe-pending-maintenance-actions
{
    &amp;quot;PendingMaintenanceActions&amp;quot;: [
        {
            &amp;quot;PendingMaintenanceActionDetails&amp;quot;: [
                {
                    &amp;quot;Action&amp;quot;: &amp;quot;system-update&amp;quot;, 
                    &amp;quot;Description&amp;quot;: &amp;quot;Upgrade to Aurora PostgreSQL 3.1.2&amp;quot;
                }
            ], 
            &amp;quot;ResourceIdentifier&amp;quot;: &amp;quot;arn:aws:rds:ap-northeast-1:xxxxxx:cluster:xxxxxxxpostgresv11&amp;quot;
        }, 
        {
            &amp;quot;PendingMaintenanceActionDetails&amp;quot;: [
                {
                    &amp;quot;Action&amp;quot;: &amp;quot;system-update&amp;quot;, 
                    &amp;quot;CurrentApplyDate&amp;quot;: &amp;quot;2020-05-08T18:33:00Z&amp;quot;, 
                    &amp;quot;AutoAppliedAfterDate&amp;quot;: &amp;quot;2020-05-08T18:33:00Z&amp;quot;, 
                    &amp;quot;Description&amp;quot;: &amp;quot;Engine Patch Upgrade&amp;quot;
                }
            ], 
            &amp;quot;ResourceIdentifier&amp;quot;: &amp;quot;arn:aws:rds:ap-northeast-1:xxxxxxx:cluster:xxxxxxx-cluster&amp;quot;
        } 
    ]
}

&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;CLIの場合はAvailable(利用可能)かRequired(必須) かどうかは項目を見るだけではわからない。Required(必須)の場合は&lt;code&gt;AutoAppliedAfterDate&lt;/code&gt;、&lt;code&gt;CurrentApplyDate&lt;/code&gt;が出力されるようである。&lt;/p&gt;
&lt;p&gt;各項目の説明は以下の通り。&lt;/p&gt;
&lt;table&gt;
&lt;thead&gt;
&lt;tr&gt;
&lt;th&gt;項目&lt;/th&gt;
&lt;th&gt;説明&lt;/th&gt;
&lt;/tr&gt;
&lt;/thead&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;Action&lt;/td&gt;
&lt;td&gt;リソースで使用可能な保留中のメンテナンスアクションのタイプ&lt;br /&gt;system-update、db-upgrade、hardware-maintenance、とca-certificate-rotation。&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;Description&lt;/td&gt;
&lt;td&gt;メンテナンスアクションの詳細を説明&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;AutoAppliedAfterDate&lt;/td&gt;
&lt;td&gt;アクションが適用されるメンテナンスウィンドウの日付&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;CurrentApplyDate&lt;/td&gt;
&lt;td&gt;保留中のメンテナンスアクションがリソースに適用される発効日&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;ForcedApplyDate&lt;/td&gt;
&lt;td&gt;メンテナンスアクションが自動的に適用される日付。（延期不可）&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;OptInStatus&lt;/td&gt;
&lt;td&gt;リソースに対して受信されたオプトイン要求のタイプ&lt;br /&gt;明示的に&lt;a href=&#34;https://docs.aws.amazon.com/cli/latest/reference/rds/apply-pending-maintenance-action.html&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;apply-pending-maintenance-action&lt;/a&gt;を実行した場合に出力される。&lt;br /&gt;&amp;ldquo;next-maintenance&amp;rdquo;、&amp;ldquo;immediate&amp;rdquo;、&amp;ldquo;undo-opt-in&amp;rdquo;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;OptInStatusのステータスは&lt;code&gt;apply-pending-maintenance-action&lt;/code&gt;で明示的に指定した場合に出力される。もしくはマネージメントコンソール上の「Upgrade at Next Window(次のウィンドウでアップグレード)」や「Upgrade Now(今すぐアップグレード)」を選択する。&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;[ec2-user@bastin ~]$ aws rds apply-pending-maintenance-action --resource-identifier arn:aws:rds:ap-northeast-1:xxxxxxxxxxxxxx:cluster:neptestdb-cluster --apply-action system-update --opt-in-type next-maintenance
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;次の通り、&lt;code&gt;OptInStatus&lt;/code&gt;が出力されるようになる&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;[ec2-user@bastin ~]$ aws rds describe-pending-maintenance-actions --resource-identifier arn:aws:rds:ap-northeast-1:xxxxxxxxxxxxxx:cluster:neptestdb-cluster
{
    &amp;quot;PendingMaintenanceActions&amp;quot;: [
        {
            &amp;quot;PendingMaintenanceActionDetails&amp;quot;: [
                {
                    &amp;quot;Action&amp;quot;: &amp;quot;system-update&amp;quot;, 
                    &amp;quot;Description&amp;quot;: &amp;quot;Engine Patch Upgrade&amp;quot;, 
                    &amp;quot;CurrentApplyDate&amp;quot;: &amp;quot;2020-05-03T15:58:00Z&amp;quot;, 
                    &amp;quot;AutoAppliedAfterDate&amp;quot;: &amp;quot;2020-05-03T15:58:00Z&amp;quot;, 
                    &amp;quot;OptInStatus&amp;quot;: &amp;quot;next-maintenance&amp;quot;
                }
            ], 
            &amp;quot;ResourceIdentifier&amp;quot;: &amp;quot;arn:aws:rds:ap-northeast-1:xxxxxxx:cluster:xxxxxxx-cluster&amp;quot;
        }
    ]
}

&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;参考：&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;a href=&#34;https://docs.aws.amazon.com/AmazonRDS/latest/APIReference/API_PendingMaintenanceAction.html&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;https://docs.aws.amazon.com/AmazonRDS/latest/APIReference/API_PendingMaintenanceAction.html&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://docs.aws.amazon.com/cli/latest/reference/rds/apply-pending-maintenance-action.html&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;https://docs.aws.amazon.com/cli/latest/reference/rds/apply-pending-maintenance-action.html&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
</description>
    </item>
    
    <item>
      <title>SPARQLクエリ集メモ</title>
      <link>/sparql-query-note.html</link>
      <pubDate>Mon, 27 Jul 2020 00:00:00 +0000</pubDate>
      <guid>/sparql-query-note.html</guid>
      <description>&lt;p&gt;初見のSPARQLエンドポイントに向けて実行するSPARQLクエリをメモ。DBPediaのSPARQLエンドポイントでお試しください。&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;a href=&#34;http://ja.dbpedia.org/sparql&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;http://ja.dbpedia.org/sparql&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h4 id=&#34;エンドポイントにどんなトリプルがあるのか&#34;&gt;エンドポイントにどんなトリプルがあるのか&lt;/h4&gt;
&lt;pre&gt;&lt;code class=&#34;language-sql&#34;&gt;SELECT *
WHERE {
  ?s ?p ?o .
}
LIMIT 100
OFFSET 0 
&lt;/code&gt;&lt;/pre&gt;
&lt;h4 id=&#34;エンドポイントのトリプル数&#34;&gt;エンドポイントのトリプル数&lt;/h4&gt;
&lt;pre&gt;&lt;code class=&#34;language-sql&#34;&gt;SELECT (COUNT(*) AS ?count)
WHERE {
  ?s ?p ?o .
}
&lt;/code&gt;&lt;/pre&gt;
&lt;h4 id=&#34;型の確認&#34;&gt;型の確認&lt;/h4&gt;
&lt;pre&gt;&lt;code class=&#34;language-sql&#34;&gt;SELECT DISTINCT ?type WHERE {
  ?s a ?type
}
&lt;/code&gt;&lt;/pre&gt;
&lt;h4 id=&#34;どのようなプロパティがあるかを確認&#34;&gt;どのようなプロパティがあるかを確認&lt;/h4&gt;
&lt;pre&gt;&lt;code class=&#34;language-sql&#34;&gt;SELECT DISTINCT ?p WHERE {
  ?s a &amp;lt;http://dbpedia.org/ontology/Anime&amp;gt; ;
    ?p ?o.
}
&lt;/code&gt;&lt;/pre&gt;
&lt;h4 id=&#34;名前付きグラフも合算してトリプル数を検索する&#34;&gt;名前付きグラフも合算してトリプル数を検索する&lt;/h4&gt;
&lt;pre&gt;&lt;code class=&#34;language-sql&#34;&gt;SELECT (COUNT(*) AS ?count)
WHERE {
  { 
    ?s ?p ?o .
  } UNION {
    GRAPH ?g { 
      ?s ?p ?o .
    } 
  }
}
&lt;/code&gt;&lt;/pre&gt;
&lt;h4 id=&#34;名前付きグラフの一覧を取得する&#34;&gt;名前付きグラフの一覧を取得する&lt;/h4&gt;
&lt;pre&gt;&lt;code class=&#34;language-sql&#34;&gt;SELECT DISTINCT ?g
WHERE {
  GRAPH ?g { 
    ?s ?p ?o . 
  }
}
&lt;/code&gt;&lt;/pre&gt;
&lt;h4 id=&#34;名前付きグラフ毎の件数を集計&#34;&gt;名前付きグラフ毎の件数を集計&lt;/h4&gt;
&lt;pre&gt;&lt;code class=&#34;language-sql&#34;&gt;SELECT ?g count(?g) WHERE {GRAPH ?g {?s ?p ?o}} GROUP BY ?g
&lt;/code&gt;&lt;/pre&gt;
&lt;h4 id=&#34;名前付きグラフのデータを検索&#34;&gt;名前付きグラフのデータを検索&lt;/h4&gt;
&lt;pre&gt;&lt;code class=&#34;language-sql&#34;&gt;SELECT * WHERE { GRAPH &amp;lt;あるグラフ&amp;gt; {?s ?p ?o }}
&lt;/code&gt;&lt;/pre&gt;
&lt;h4 id=&#34;プロパティの一覧を取得する&#34;&gt;プロパティの一覧を取得する&lt;/h4&gt;
&lt;pre&gt;&lt;code class=&#34;language-sql&#34;&gt;SELECT DISTINCT ?p
WHERE {
  ?s ?p ?o .
}
LIMIT 100
&lt;/code&gt;&lt;/pre&gt;
&lt;h4 id=&#34;プロパティの一覧を使用頻度順に取得する&#34;&gt;プロパティの一覧を使用頻度順に取得する&lt;/h4&gt;
&lt;pre&gt;&lt;code class=&#34;language-sql&#34;&gt;SELECT ?p (COUNT(?p) AS ?count)
WHERE {
  ?s ?p ?o .
} 
GROUP BY ?p
ORDER BY DESC(?count)
LIMIT 100
&lt;/code&gt;&lt;/pre&gt;
&lt;h4 id=&#34;主語あたりの平均プロパティ数&#34;&gt;主語あたりの平均プロパティ数&lt;/h4&gt;
&lt;pre&gt;&lt;code class=&#34;language-sql&#34;&gt;SELECT (AVG(?count) AS ?average)
WHERE {
  SELECT ?s (COUNT(?p) as ?count)
  WHERE {
    ?s ?p ?o .
  } 
  GROUP BY ?s
}
&lt;/code&gt;&lt;/pre&gt;
&lt;h4 id=&#34;検索データが含まれるデータを探したい主語から探す&#34;&gt;&amp;lt;検索データ&amp;gt;が含まれるデータを探したい（主語から探す）&lt;/h4&gt;
&lt;pre&gt;&lt;code class=&#34;language-sql&#34;&gt;SELECT * { GRAPH ?g { ?s ?p ?o . FILTER( contains(str(?s),&#39;&amp;lt;検索データ&amp;gt;&#39;) ) }}
&lt;/code&gt;&lt;/pre&gt;
&lt;h4 id=&#34;検索データが含まれるデータを探したい述語から探す&#34;&gt;&amp;lt;検索データ&amp;gt;が含まれるデータを探したい（述語から探す）&lt;/h4&gt;
&lt;pre&gt;&lt;code class=&#34;language-sql&#34;&gt;SELECT * { GRAPH ?g { ?s ?p ?o . FILTER( contains(str(?p),&#39;&amp;lt;検索データ&amp;gt;&#39;) ) }}
&lt;/code&gt;&lt;/pre&gt;
&lt;h4 id=&#34;検索データが含まれるデータを探したい目的語から探す&#34;&gt;&amp;lt;検索データ&amp;gt;が含まれるデータを探したい（目的語から探す）&lt;/h4&gt;
&lt;pre&gt;&lt;code class=&#34;language-sql&#34;&gt;SELECT * { GRAPH ?g { ?s ?p ?o . FILTER( contains(str(?o),&#39;&amp;lt;検索データ&amp;gt;&#39;) ) }}
&lt;/code&gt;&lt;/pre&gt;
&lt;h4 id=&#34;グラフ完全一致でデータを探す&#34;&gt;&lt;strong&gt;グラフ&lt;/strong&gt;完全一致でデータを探す&lt;/h4&gt;
&lt;pre&gt;&lt;code class=&#34;language-sql&#34;&gt;SELECT * { GRAPH &amp;lt;グラフ&amp;gt; {?s ?p ?o}}
&lt;/code&gt;&lt;/pre&gt;
&lt;h4 id=&#34;主語完全一致でデータを探す&#34;&gt;&lt;strong&gt;主語&lt;/strong&gt;完全一致でデータを探す&lt;/h4&gt;
&lt;pre&gt;&lt;code class=&#34;language-sql&#34;&gt;SELECT * { GRAPH ?g {&amp;lt;主語&amp;gt; ?p ?o}}
&lt;/code&gt;&lt;/pre&gt;
&lt;h4 id=&#34;述語完全一致でデータを探す&#34;&gt;&lt;strong&gt;述語&lt;/strong&gt;完全一致でデータを探す&lt;/h4&gt;
&lt;pre&gt;&lt;code class=&#34;language-sql&#34;&gt;SELECT * { GRAPH ?g {?s &amp;lt;述語&amp;gt; ?o}}
&lt;/code&gt;&lt;/pre&gt;
&lt;h4 id=&#34;目的語完全一致でデータを探す&#34;&gt;&lt;strong&gt;目的語&lt;/strong&gt;完全一致でデータを探す&lt;/h4&gt;
&lt;pre&gt;&lt;code class=&#34;language-sql&#34;&gt;SELECT * { GRAPH ?g {?s ?p &#39;目的語&#39;}}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;参考サイト：&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;よく使うSPARQLサンプル集 - Qiita &lt;a href=&#34;https://qiita.com/hodade/items/30158fba9e943132023f&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;https://qiita.com/hodade/items/30158fba9e943132023f&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;SPARQL入門 &lt;a href=&#34;http://www.aise.ics.saitama-u.ac.jp/~gotoh/IntroSPARQL.html&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;http://www.aise.ics.saitama-u.ac.jp/~gotoh/IntroSPARQL.html&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
</description>
    </item>
    
    <item>
      <title>Neptuneへのバルクロード実行時に圧縮ファイルを使用する</title>
      <link>/aws-neptune-bulkload-from-s3-gzip.html</link>
      <pubDate>Tue, 12 May 2020 00:00:00 +0000</pubDate>
      <guid>/aws-neptune-bulkload-from-s3-gzip.html</guid>
      <description>&lt;h3 id=&#34;目的&#34;&gt;目的&lt;/h3&gt;
&lt;p&gt;gzip形式の圧縮ファイルをサポートしているとあったので、単純な興味からS3からのNeptuneへのバルクロードの時間比較をしてみた。&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;ロードデータ形式 - Amazon Neptune &lt;a href=&#34;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/bulk-load-tutorial-format.html&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/bulk-load-tutorial-format.html&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Neptune は、gzip 形式の単一ファイルの圧縮をサポートしています。ファイル名には .gz 拡張子を付ける必要があり、UTF-8 形式でエンコードされた単一のテキストファイルを含む必要があります。複数のファイルをロードできますが、それぞれは個別の .gz ファイル (非圧縮のテキストファイル) に含まれている必要があります。アーカイブファイル (例: .tar、.tar.gz、および .tgz) はサポートされていません。&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;ちなみに、Redshiftへのロード時の圧縮ファイルと非圧縮ファイルの差異はこんな感じらしい。（この記事を見てNeptuneではどうなのか？が気になった。）&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;【新機能】Redshift COPY/UNLOADのBZIP2ファイル対応を試してみました | Developers.IO &lt;a href=&#34;https://dev.classmethod.jp/articles/amazon-redshift-bzip2-support/#toc-4&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;https://dev.classmethod.jp/articles/amazon-redshift-bzip2-support/#toc-4&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h3 id=&#34;前提&#34;&gt;前提&lt;/h3&gt;
&lt;p&gt;&lt;code&gt;db.r5.4xlarge&lt;/code&gt;で実行。&lt;code&gt;parallelism&lt;/code&gt; ではHIGHを指定。特に指定しなくてもデフォルトはHIGHで動作する。HIGHの場合のCPU使用率は80％～100％で推移をしていた。&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;a href=&#34;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/load-api-reference-load.html&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/load-api-reference-load.html&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;gt; Neptune ローダーのリクエストパラメータ&lt;/p&gt;
&lt;p&gt;LOW – 使用されるスレッドの数は、コア数を 8 で割った値です。&lt;/p&gt;
&lt;p&gt;MEDIUM – 使用されるスレッドの数は、コア数を 2 で割った値です。&lt;/p&gt;
&lt;p&gt;HIGH – 使用されるスレッドの数は、コア数と同じです。&lt;/p&gt;
&lt;p&gt;OVERSUBSCRIBE – 使用されるスレッドの数は、コア数に 2 を乗算した値です。この値を使用する場合、バルクローダーは利用可能なすべてのリソースを消費します。&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h3 id=&#34;結果&#34;&gt;結果&lt;/h3&gt;
&lt;p&gt;トリプル数が1000万件だと有意な差異が無かった。一方1億トリプルの場合はデータロード時間に150秒の差異が出た。&lt;/p&gt;
&lt;table&gt;
&lt;thead&gt;
&lt;tr&gt;
&lt;th&gt;&lt;/th&gt;
&lt;th&gt;パラレリズム&lt;/th&gt;
&lt;th&gt;圧縮&lt;/th&gt;
&lt;th&gt;データロード&lt;/th&gt;
&lt;th&gt;データ削除(drop all)&lt;/th&gt;
&lt;/tr&gt;
&lt;/thead&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;1000万トリプル&lt;/td&gt;
&lt;td&gt;HIGH&lt;/td&gt;
&lt;td&gt;非圧縮&lt;/td&gt;
&lt;td&gt;139秒&lt;/td&gt;
&lt;td&gt;420秒&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;1000万トリプル&lt;/td&gt;
&lt;td&gt;HIGH&lt;/td&gt;
&lt;td&gt;圧縮&lt;/td&gt;
&lt;td&gt;140秒&lt;/td&gt;
&lt;td&gt;417秒&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;1億トリプル&lt;/td&gt;
&lt;td&gt;HIGH&lt;/td&gt;
&lt;td&gt;非圧縮&lt;/td&gt;
&lt;td&gt;1169秒&lt;/td&gt;
&lt;td&gt;4866秒&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;1億トリプル&lt;/td&gt;
&lt;td&gt;HIGH&lt;/td&gt;
&lt;td&gt;圧縮&lt;/td&gt;
&lt;td&gt;1303秒&lt;/td&gt;
&lt;td&gt;4844秒&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;CPU使用率は&lt;code&gt;parallelism&lt;/code&gt; をHIGHで実行していることもあって、ロード実行時はは80％～100％の間で推移していた。データ削除は&lt;code&gt;drop all&lt;/code&gt;で実行したが、こちらの場合はシングルスレッドでdropしているためか約20％で推移をしていた。&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image-20200504213906083.png&#34; alt=&#34;image-20200504213906083&#34; style=&#34;zoom: 67%;&#34; /&gt;&lt;/p&gt;
&lt;p&gt;なお、ロード時間を短くするためには下記のベストプラクティスのページにもある通り、一時的にスケールアップした上でロードするのが良い。その分パラレル化されてロード時間が短くなる。&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Amazon Neptune の基本的な運用についてのガイドライン - Amazon Neptune &lt;a href=&#34;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/best-practices-general-basic.html#best-practices-loader-tempinstance&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/best-practices-general-basic.html#best-practices-loader-tempinstance&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;一時的に大きなインスタンスを使用してロード時間を短縮&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h3 id=&#34;実行時のコマンドと結果&#34;&gt;実行時のコマンドと結果&lt;/h3&gt;
&lt;p&gt;以下は実行した際のコマンドと実行結果を参考までに。&lt;/p&gt;
&lt;h4 id=&#34;1000万件のトリプル非圧縮&#34;&gt;1000万件のトリプル（非圧縮）&lt;/h4&gt;
&lt;h5 id=&#34;s3からのバルクロード&#34;&gt;S3からのバルクロード&lt;/h5&gt;
&lt;pre&gt;&lt;code&gt;curl -X POST \
    -H &#39;Content-Type: application/json&#39; \
    https://xxxxxxxxx.xxxxxxxxx.ap-northeast-1.neptune.amazonaws.com:8182/loader -d &#39;
    {
      &amp;quot;source&amp;quot; : &amp;quot;s3://xxxxxxxxxx/non-compression/rdf-test.nq&amp;quot;, 
      &amp;quot;format&amp;quot; : &amp;quot;nquads&amp;quot;,
      &amp;quot;iamRoleArn&amp;quot; : &amp;quot;arn:aws:iam::xxxxxxxxxx:role/NeptuneLoadFromS3&amp;quot;,
      &amp;quot;region&amp;quot; : &amp;quot;ap-northeast-1&amp;quot;,
      &amp;quot;failOnError&amp;quot; : &amp;quot;FALSE&amp;quot;,
      &amp;quot;parallelism&amp;quot; : &amp;quot;HIGH&amp;quot;
    }&#39;
&lt;/code&gt;&lt;/pre&gt;
&lt;h5 id=&#34;s3からのバルクロードのステータス確認&#34;&gt;S3からのバルクロードのステータス確認&lt;/h5&gt;
&lt;pre&gt;&lt;code&gt;curl -G &#39;https://xxxxxxxxx.xxxxxxxxx.ap-northeast-1.neptune.amazonaws.com:8182/loader/4b197f60-9239-4ab3-8b21-6a320930df51&#39;
{
    &amp;quot;status&amp;quot; : &amp;quot;200 OK&amp;quot;,
    &amp;quot;payload&amp;quot; : {
        &amp;quot;feedCount&amp;quot; : [
            {
                &amp;quot;LOAD_COMPLETED&amp;quot; : 1
            }
        ],
        &amp;quot;overallStatus&amp;quot; : {
            &amp;quot;fullUri&amp;quot; : &amp;quot;s3://xxxxxxxxxx/non-compression/rdf-test.nq&amp;quot;,
            &amp;quot;runNumber&amp;quot; : 1,
            &amp;quot;retryNumber&amp;quot; : 0,
            &amp;quot;status&amp;quot; : &amp;quot;LOAD_COMPLETED&amp;quot;,
            &amp;quot;totalTimeSpent&amp;quot; : 139,
            &amp;quot;startTime&amp;quot; : 1588592100,
            &amp;quot;totalRecords&amp;quot; : 10000000,
            &amp;quot;totalDuplicates&amp;quot; : 0,
            &amp;quot;parsingErrors&amp;quot; : 0,
            &amp;quot;datatypeMismatchErrors&amp;quot; : 0,
            &amp;quot;insertErrors&amp;quot; : 0
        }
    }
}
&lt;/code&gt;&lt;/pre&gt;
&lt;h5 id=&#34;データ削除&#34;&gt;データ削除&lt;/h5&gt;
&lt;pre&gt;&lt;code&gt;curl -X POST --data-binary &#39;update=drop all&#39; https://xxxxxxxxx.xxxxxxxxx.ap-northeast-1.neptune.amazonaws.com:8182/sparql
[
{
    &amp;quot;type&amp;quot; : &amp;quot;UpdateEvent&amp;quot;,
    &amp;quot;totalElapsedMillis&amp;quot; : 420916,
    &amp;quot;elapsedMillis&amp;quot; : 420915,
    &amp;quot;connFlush&amp;quot; : 0,
    &amp;quot;batchResolve&amp;quot; : 0,
    &amp;quot;whereClause&amp;quot; : 0,
    &amp;quot;deleteClause&amp;quot; : 0,
    &amp;quot;insertClause&amp;quot; : 0
},
{
    &amp;quot;type&amp;quot; : &amp;quot;Commit&amp;quot;,
    &amp;quot;totalElapsedMillis&amp;quot; : 421169
}
]
&lt;/code&gt;&lt;/pre&gt;
&lt;h4 id=&#34;1000万件のトリプル圧縮&#34;&gt;1000万件のトリプル（圧縮）&lt;/h4&gt;
&lt;h5 id=&#34;s3からのバルクロード-1&#34;&gt;S3からのバルクロード&lt;/h5&gt;
&lt;pre&gt;&lt;code&gt;curl -X POST \
    -H &#39;Content-Type: application/json&#39; \
    https://xxxxxxxxx.xxxxxxxxx.ap-northeast-1.neptune.amazonaws.com:8182/loader -d &#39;
    {
      &amp;quot;source&amp;quot; : &amp;quot;s3://xxxxxxxxxx/compression/rdf-test.nq.gz&amp;quot;, 
      &amp;quot;format&amp;quot; : &amp;quot;nquads&amp;quot;,
      &amp;quot;iamRoleArn&amp;quot; : &amp;quot;arn:aws:iam::xxxxxxxxxx:role/NeptuneLoadFromS3&amp;quot;,
      &amp;quot;region&amp;quot; : &amp;quot;ap-northeast-1&amp;quot;,
      &amp;quot;failOnError&amp;quot; : &amp;quot;FALSE&amp;quot;,
      &amp;quot;parallelism&amp;quot; : &amp;quot;HIGH&amp;quot;
    }&#39;
&lt;/code&gt;&lt;/pre&gt;
&lt;h5 id=&#34;s3からのバルクロードのステータス確認-1&#34;&gt;S3からのバルクロードのステータス確認&lt;/h5&gt;
&lt;pre&gt;&lt;code&gt;curl -G &#39;https://xxxxxxxxx.xxxxxxxxx.ap-northeast-1.neptune.amazonaws.com:8182/loader/f1e8303c-077b-44f8-a6f2-c1b65a6f61e6&#39;
{
    &amp;quot;status&amp;quot; : &amp;quot;200 OK&amp;quot;,
    &amp;quot;payload&amp;quot; : {
        &amp;quot;feedCount&amp;quot; : [
            {
                &amp;quot;LOAD_COMPLETED&amp;quot; : 1
            }
        ],
        &amp;quot;overallStatus&amp;quot; : {
            &amp;quot;fullUri&amp;quot; : &amp;quot;s3://xxxxxxxxxx/compression/rdf-test.nq.gz&amp;quot;,
            &amp;quot;runNumber&amp;quot; : 1,
            &amp;quot;retryNumber&amp;quot; : 0,
            &amp;quot;status&amp;quot; : &amp;quot;LOAD_COMPLETED&amp;quot;,
            &amp;quot;totalTimeSpent&amp;quot; : 140,
            &amp;quot;startTime&amp;quot; : 1588592750,
            &amp;quot;totalRecords&amp;quot; : 10000000,
            &amp;quot;totalDuplicates&amp;quot; : 0,
            &amp;quot;parsingErrors&amp;quot; : 0,
            &amp;quot;datatypeMismatchErrors&amp;quot; : 0,
            &amp;quot;insertErrors&amp;quot; : 0
        }
    }
}
&lt;/code&gt;&lt;/pre&gt;
&lt;h5 id=&#34;データ削除-1&#34;&gt;データ削除&lt;/h5&gt;
&lt;pre&gt;&lt;code&gt;curl -X POST --data-binary &#39;update=drop all&#39; https://xxxxxxxxx.xxxxxxxxx.ap-northeast-1.neptune.amazonaws.com:8182/sparql
[
{
    &amp;quot;type&amp;quot; : &amp;quot;UpdateEvent&amp;quot;,
    &amp;quot;totalElapsedMillis&amp;quot; : 417666,
    &amp;quot;elapsedMillis&amp;quot; : 417665,
    &amp;quot;connFlush&amp;quot; : 0,
    &amp;quot;batchResolve&amp;quot; : 0,
    &amp;quot;whereClause&amp;quot; : 0,
    &amp;quot;deleteClause&amp;quot; : 0,
    &amp;quot;insertClause&amp;quot; : 0
},
{
    &amp;quot;type&amp;quot; : &amp;quot;Commit&amp;quot;,
    &amp;quot;totalElapsedMillis&amp;quot; : 417913
}
]
&lt;/code&gt;&lt;/pre&gt;
&lt;h4 id=&#34;1億件のトリプル非圧縮&#34;&gt;1億件のトリプル（非圧縮）&lt;/h4&gt;
&lt;h5 id=&#34;s3からのバルクロード-2&#34;&gt;S3からのバルクロード&lt;/h5&gt;
&lt;pre&gt;&lt;code&gt;curl -X POST \
    -H &#39;Content-Type: application/json&#39; \
    https://xxxxxxxxx.xxxxxxxxx.ap-northeast-1.neptune.amazonaws.com:8182/loader -d &#39;
    {
      &amp;quot;source&amp;quot; : &amp;quot;s3://xxxxxxxxxx/non-compression/neptune-load.nq&amp;quot;, 
      &amp;quot;format&amp;quot; : &amp;quot;nquads&amp;quot;,
      &amp;quot;iamRoleArn&amp;quot; : &amp;quot;arn:aws:iam::xxxxxxxxxx:role/NeptuneLoadFromS3&amp;quot;,
      &amp;quot;region&amp;quot; : &amp;quot;ap-northeast-1&amp;quot;,
      &amp;quot;failOnError&amp;quot; : &amp;quot;FALSE&amp;quot;,
      &amp;quot;parallelism&amp;quot; : &amp;quot;HIGH&amp;quot;
    }&#39;
&lt;/code&gt;&lt;/pre&gt;
&lt;h5 id=&#34;s3からのバルクロードのステータス確認-2&#34;&gt;S3からのバルクロードのステータス確認&lt;/h5&gt;
&lt;pre&gt;&lt;code&gt;curl -G &#39;https://xxxxxxxxx.xxxxxxxxx.ap-northeast-1.neptune.amazonaws.com:8182/loader/56d84748-5b1c-4ff6-945c-15899da10c62&#39;
{
    &amp;quot;status&amp;quot; : &amp;quot;200 OK&amp;quot;,
    &amp;quot;payload&amp;quot; : {
        &amp;quot;feedCount&amp;quot; : [
            {
                &amp;quot;LOAD_COMPLETED&amp;quot; : 1
            }
        ],
        &amp;quot;overallStatus&amp;quot; : {
            &amp;quot;fullUri&amp;quot; : &amp;quot;s3://xxxxxxxxxx/non-compression/neptune-load.nq&amp;quot;,
            &amp;quot;runNumber&amp;quot; : 1,
            &amp;quot;retryNumber&amp;quot; : 0,
            &amp;quot;status&amp;quot; : &amp;quot;LOAD_COMPLETED&amp;quot;,
            &amp;quot;totalTimeSpent&amp;quot; : 1169,
            &amp;quot;startTime&amp;quot; : 1588594197,
            &amp;quot;totalRecords&amp;quot; : 100000000,
            &amp;quot;totalDuplicates&amp;quot; : 0,
            &amp;quot;parsingErrors&amp;quot; : 0,
            &amp;quot;datatypeMismatchErrors&amp;quot; : 0,
            &amp;quot;insertErrors&amp;quot; : 0
        }
    }
}
&lt;/code&gt;&lt;/pre&gt;
&lt;h5 id=&#34;データ削除-2&#34;&gt;データ削除&lt;/h5&gt;
&lt;pre&gt;&lt;code&gt;curl -X POST --data-binary &#39;update=drop all&#39; https://xxxxxxxxx.xxxxxxxxx.ap-northeast-1.neptune.amazonaws.com:8182/sparql
[
{
    &amp;quot;type&amp;quot; : &amp;quot;UpdateEvent&amp;quot;,
    &amp;quot;totalElapsedMillis&amp;quot; : 4866624,
    &amp;quot;elapsedMillis&amp;quot; : 4866623,
    &amp;quot;connFlush&amp;quot; : 0,
    &amp;quot;batchResolve&amp;quot; : 0,
    &amp;quot;whereClause&amp;quot; : 0,
    &amp;quot;deleteClause&amp;quot; : 0,
    &amp;quot;insertClause&amp;quot; : 0
},
{
    &amp;quot;type&amp;quot; : &amp;quot;Commit&amp;quot;,
    &amp;quot;totalElapsedMillis&amp;quot; : 4871394
}
]
&lt;/code&gt;&lt;/pre&gt;
&lt;h4 id=&#34;1億件のトリプル圧縮&#34;&gt;1億件のトリプル（圧縮）&lt;/h4&gt;
&lt;h5 id=&#34;s3からのバルクロード-3&#34;&gt;S3からのバルクロード&lt;/h5&gt;
&lt;pre&gt;&lt;code&gt;curl -X POST \
    -H &#39;Content-Type: application/json&#39; \
    https://xxxxxxxxx.xxxxxxxxx.ap-northeast-1.neptune.amazonaws.com:8182/loader -d &#39;
    {
      &amp;quot;source&amp;quot; : &amp;quot;s3://xxxxxxxxxx/compression/neptune-load.nq.gz&amp;quot;, 
      &amp;quot;format&amp;quot; : &amp;quot;nquads&amp;quot;,
      &amp;quot;iamRoleArn&amp;quot; : &amp;quot;arn:aws:iam::xxxxxxxxxx:role/NeptuneLoadFromS3&amp;quot;,
      &amp;quot;region&amp;quot; : &amp;quot;ap-northeast-1&amp;quot;,
      &amp;quot;failOnError&amp;quot; : &amp;quot;FALSE&amp;quot;,
      &amp;quot;parallelism&amp;quot; : &amp;quot;HIGH&amp;quot;
    }&#39;
&lt;/code&gt;&lt;/pre&gt;
&lt;h5 id=&#34;s3からのバルクロードのステータス確認-3&#34;&gt;S3からのバルクロードのステータス確認&lt;/h5&gt;
&lt;pre&gt;&lt;code&gt;curl -G &#39;https://xxxxxxxxx.xxxxxxxxx.ap-northeast-1.neptune.amazonaws.com:8182/loader/b7e34c0c-bf49-42d6-885b-34e58fed19c0&#39;
{
    &amp;quot;status&amp;quot; : &amp;quot;200 OK&amp;quot;,
    &amp;quot;payload&amp;quot; : {
        &amp;quot;feedCount&amp;quot; : [
            {
                &amp;quot;LOAD_COMPLETED&amp;quot; : 1
            }
        ],
        &amp;quot;overallStatus&amp;quot; : {
            &amp;quot;fullUri&amp;quot; : &amp;quot;s3://xxxxxxxxxx/compression/neptune-load.nq.gz&amp;quot;,
            &amp;quot;runNumber&amp;quot; : 1,
            &amp;quot;retryNumber&amp;quot; : 0,
            &amp;quot;status&amp;quot; : &amp;quot;LOAD_COMPLETED&amp;quot;,
            &amp;quot;totalTimeSpent&amp;quot; : 1303,
            &amp;quot;startTime&amp;quot; : 1588600418,
            &amp;quot;totalRecords&amp;quot; : 100000000,
            &amp;quot;totalDuplicates&amp;quot; : 0,
            &amp;quot;parsingErrors&amp;quot; : 0,
            &amp;quot;datatypeMismatchErrors&amp;quot; : 0,
            &amp;quot;insertErrors&amp;quot; : 0
        }
    }
}
&lt;/code&gt;&lt;/pre&gt;
&lt;h5 id=&#34;データ削除-3&#34;&gt;データ削除&lt;/h5&gt;
&lt;pre&gt;&lt;code&gt;curl -X POST --data-binary &#39;update=drop all&#39; https://xxxxxxxxx.xxxxxxxxx.ap-northeast-1.neptune.amazonaws.com:8182/sparql
[
{
    &amp;quot;type&amp;quot; : &amp;quot;UpdateEvent&amp;quot;,
    &amp;quot;totalElapsedMillis&amp;quot; : 4844456,
    &amp;quot;elapsedMillis&amp;quot; : 4844455,
    &amp;quot;connFlush&amp;quot; : 0,
    &amp;quot;batchResolve&amp;quot; : 0,
    &amp;quot;whereClause&amp;quot; : 0,
    &amp;quot;deleteClause&amp;quot; : 0,
    &amp;quot;insertClause&amp;quot; : 0
},
{
    &amp;quot;type&amp;quot; : &amp;quot;Commit&amp;quot;,
    &amp;quot;totalElapsedMillis&amp;quot; : 4848418
}
]
&lt;/code&gt;&lt;/pre&gt;
</description>
    </item>
    
    <item>
      <title>Neptuneで実行中のクエリを確認する</title>
      <link>/aws-neptune-execute-query-check.html</link>
      <pubDate>Thu, 07 May 2020 00:00:00 +0000</pubDate>
      <guid>/aws-neptune-execute-query-check.html</guid>
      <description>&lt;p&gt;特定のクエリを実行した場合に下記のようなエラーが発生する場合がある。原因は処理の競合。&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;{
	&amp;quot;requestId&amp;quot;: &amp;quot;c4b8f484-2de1-b8a4-81dd-6b225981653f&amp;quot;,
	&amp;quot;code&amp;quot;: &amp;quot;ConcurrentModificationException&amp;quot;,
	&amp;quot;detailedMessage&amp;quot;: &amp;quot;Operation failed due to conflicting concurrent operations (please retry), 0 transactions are currently rolling back.&amp;quot;
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;他にどんなクエリが流れているか確認したい場合にはSPARQL クエリステータス APIを使用。queryStringが実際に流れているSPARQLクエリとなる。&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;[ec2-user@bastin ~]$ curl https://xxxxxxxx.xxxxxx.ap-northeast-1.neptune.amazonaws.com:8182/sparql/status | jq
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100   205    0   205    0     0   9318      0 --:--:-- --:--:-- --:--:--  9318
{
  &amp;quot;acceptedQueryCount&amp;quot;: 8,
  &amp;quot;runningQueryCount&amp;quot;: 1,
  &amp;quot;queries&amp;quot;: [
    {
      &amp;quot;queryId&amp;quot;: &amp;quot;372954e5-f674-497e-ae1f-0d772e636e41&amp;quot;,
      &amp;quot;queryEvalStats&amp;quot;: {
        &amp;quot;subqueries&amp;quot;: 0,
        &amp;quot;elapsed&amp;quot;: 1034223,
        &amp;quot;cancelled&amp;quot;: false
      },
      &amp;quot;queryString&amp;quot;: &amp;quot;clear all&amp;quot;
    }
  ]
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;参考&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;SPARQL クエリステータス API - Amazon Neptune &lt;a href=&#34;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/sparql-api-status.html&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/sparql-api-status.html&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
</description>
    </item>
    
    <item>
      <title>Neptuneインスタンスの監査ログを取得する方法</title>
      <link>/aws-neptune-audit-log.html</link>
      <pubDate>Tue, 07 Apr 2020 00:00:00 +0000</pubDate>
      <guid>/aws-neptune-audit-log.html</guid>
      <description>&lt;p&gt;インスタンス作成時に&lt;code&gt;監査ログ&lt;/code&gt;の有効化をチェックしていたにも関わらず、監査ログが出ないなーと思っていたら&lt;code&gt;Audit logging must be enabled for logs to be published in CloudWatch Logs. Please set the neptune_enable_audit_log parameter to enable (1) in the parameter group that is used in this database cluster.&lt;/code&gt;とあるようにパラメータの設定が必要だった模様。&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image-20200321134807338.png&#34; alt=&#34;image-20200321134807338&#34; style=&#34;zoom:67%;&#34; /&gt;&lt;/p&gt;
&lt;p&gt;監査ログが出力しないと思っていたら、&lt;code&gt;neptune_enable_audit_log&lt;/code&gt;を「0」から「1」に変更する必要があり、適用タイプがstaticなので変更時には再起動が必要。&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image-20200321134242850.png&#34; alt=&#34;image-20200321134242850&#34; style=&#34;zoom:67%;&#34; /&gt;&lt;/p&gt;
&lt;h4 id=&#34;ログサンプル&#34;&gt;ログサンプル&lt;/h4&gt;
&lt;p&gt;1つ目がNeptune Workbench から実行したクエリ、もう一つがcurlからPostしたクエリ。&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;1584766979615, 10.0.1.18:34266, 10.0.3.215:8182, HTTP_POST, [unknown], [unknown], &amp;quot;HttpObjectAggregator$AggregatedFullHttpRequest(decodeResult: success, version: HTTP/1.1, content: CompositeByteBuf(ridx: 0, widx: 79, cap: 79, components=1)) POST /sparql HTTP/1.1 Host: neptestdb-cluster.cluster-xxxxxx.ap-northeast-1.neptune.amazonaws.com:8182 User-Agent: python-requests/2.20.0 Accept-Encoding: gzip, deflate Accept: */* Connection: keep-alive Content-Length: 79 Content-Type: application/x-www-form-urlencoded&amp;quot;, query=SELECT+%2A%0AWHERE+%7B%0A++%3Fs+%3Fp+%3Fo+.%0A%7D%0ALIMIT+100%0AOFFSET+0+

1584767048270, 10.0.1.123:56336, 10.0.3.215:8182, HTTP_POST, [unknown], [unknown], &amp;quot;HttpObjectAggregator$AggregatedFullHttpRequest(decodeResult: success, version: HTTP/1.1, content: CompositeByteBuf(ridx: 0, widx: 47, cap: 47, components=1)) POST /sparql HTTP/1.1 Host: neptestdb.xxxxxxx.ap-northeast-1.neptune.amazonaws.com:8182 User-Agent: curl/7.61.1 Accept: */* Content-Length: 47 Content-Type: application/x-www-form-urlencoded&amp;quot;, query=select ?s ?p ?o where {?s ?p ?o} limit 10

&lt;/code&gt;&lt;/pre&gt;
&lt;h3 id=&#34;参考&#34;&gt;参考&lt;/h3&gt;
&lt;blockquote&gt;
&lt;p&gt;Amazon Neptune クラスターで監査ログを使用する - Amazon Neptune &lt;a href=&#34;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/auditing.html&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/auditing.html&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
</description>
    </item>
    
    <item>
      <title>Neptuneインスタンスのヘルスステータスをcurlコマンドで取得する方法</title>
      <link>/aws-neptune-health-status.html</link>
      <pubDate>Thu, 02 Apr 2020 00:00:00 +0000</pubDate>
      <guid>/aws-neptune-health-status.html</guid>
      <description>&lt;p&gt;CloudWatchやマネージメントコンソール上からもインスタンスステータスは当然分かるが、curlコマンドでも確認可能。&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;[ec2-user@bastin ~]$ curl -G https://neptestdb.xxxxxxxx.ap-northeast-1.neptune.amazonaws.com:8182/status | jq
{
  &amp;quot;status&amp;quot;: &amp;quot;healthy&amp;quot;,
  &amp;quot;startTime&amp;quot;: &amp;quot;Sat Mar 21 03:06:07 UTC 2020&amp;quot;,
  &amp;quot;dbEngineVersion&amp;quot;: &amp;quot;1.0.2.1.R4&amp;quot;,
  &amp;quot;role&amp;quot;: &amp;quot;writer&amp;quot;,
  &amp;quot;gremlin&amp;quot;: {
    &amp;quot;version&amp;quot;: &amp;quot;tinkerpop-3.4.1&amp;quot;
  },
  &amp;quot;sparql&amp;quot;: {
    &amp;quot;version&amp;quot;: &amp;quot;sparql-1.1&amp;quot;
  },
  &amp;quot;labMode&amp;quot;: {
    &amp;quot;ObjectIndex&amp;quot;: &amp;quot;disabled&amp;quot;,
    &amp;quot;Streams&amp;quot;: &amp;quot;enabled&amp;quot;,
    &amp;quot;ReadWriteConflictDetection&amp;quot;: &amp;quot;enabled&amp;quot;
  }
}

&lt;/code&gt;&lt;/pre&gt;
&lt;table&gt;
&lt;thead&gt;
&lt;tr&gt;
&lt;th&gt;項目&lt;/th&gt;
&lt;th&gt;説明&lt;/th&gt;
&lt;/tr&gt;
&lt;/thead&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;status&lt;/td&gt;
&lt;td&gt;インスタンスの状態。正常な場合はhealthy。インスタンスがクラッシュまたは再起動から回復中で、最新のサーバーのシャットダウンからアクティブなトランザクションが実行されている場合、ステータスは  &amp;ldquo;recovery&amp;rdquo; に設定&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;version&lt;/td&gt;
&lt;td&gt;Neptune エンジンバージョン。&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;startTime&lt;/td&gt;
&lt;td&gt;UTC時間でのインスタンスの起動時間&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;role&lt;/td&gt;
&lt;td&gt;writerインスタンスかReaderインスタンスか&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;gremlin&lt;/td&gt;
&lt;td&gt;エンジンで使用されている現在の TinkerPop バージョンに設定&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;sparql&lt;/td&gt;
&lt;td&gt;エンジンで使用されている SPARQL の最新バージョン&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;labMode&lt;/td&gt;
&lt;td&gt;ラボモード 設定が一覧表示&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;rollingBackTrxCount&lt;/td&gt;
&lt;td&gt;ロールバックされるトランザクションの数&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;rollingBackTrxEarliestStartTime&lt;/td&gt;
&lt;td&gt;ロールバックされる最も早いトランザクションの開始時刻&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;起動していない場合は、そもそもcurlコマンドがタイムアウト。&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;[ec2-user@bastin ~]$ curl -G https://neptestdb.xxxxxxxx.ap-northeast-1.neptune.amazonaws.com:8182/status
curl: (7) Failed to connect to neptestdb.xxxxxxxx.ap-northeast-1.neptune.amazonaws.com port 8182: Connection timed out
[ec2-user@bastin ~]$ 
&lt;/code&gt;&lt;/pre&gt;
</description>
    </item>
    
    <item>
      <title>Amazon NeptuneのRDFデータをExportする</title>
      <link>/aws-neptune-export-rdf-data.html</link>
      <pubDate>Fri, 27 Mar 2020 00:00:00 +0000</pubDate>
      <guid>/aws-neptune-export-rdf-data.html</guid>
      <description>&lt;h3 id=&#34;はじめに&#34;&gt;はじめに&lt;/h3&gt;
&lt;p&gt;awslabsに用意されているNeptune用のツールを使用してRDFデータをTurtleへエクスポートしてみる。&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;amazon-neptune-tools/neptune-export at master · awslabs/amazon-neptune-tools &lt;a href=&#34;https://github.com/awslabs/amazon-neptune-tools/tree/master/neptune-export&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;https://github.com/awslabs/amazon-neptune-tools/tree/master/neptune-export&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;詳細な使用方法について&lt;code&gt;readme.md&lt;/code&gt;をご参照ください。&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;amazon-neptune-tools/readme.md at master · awslabs/amazon-neptune-tools &lt;a href=&#34;https://github.com/awslabs/amazon-neptune-tools/blob/master/neptune-export/readme.md&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;https://github.com/awslabs/amazon-neptune-tools/blob/master/neptune-export/readme.md&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;awslabs/amazon-neptune-tools &lt;a href=&#34;https://github.com/awslabs/amazon-neptune-tools/blob/master/neptune-export/docs/export-rdf.md&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;https://github.com/awslabs/amazon-neptune-tools/blob/master/neptune-export/docs/export-rdf.md&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h3 id=&#34;注意点&#34;&gt;注意点&lt;/h3&gt;
&lt;p&gt;&lt;code&gt;Exporting an RDF Graph&lt;/code&gt; については &lt;code&gt;At present neptune-export supports exporting an RDF dataset to Turtle with a single-threaded long-running query.&lt;/code&gt;と記載があります。データ容量とか関わってきますが、シングルスレッドで動作する関係上長時間のエクスポートとなる可能性があります。実行時間や実行対象のインスタンスの負荷状況については留意する必要があると思います。クローンで別インスタンスを立てる、Read Replica側を使うなどの考慮は必要かと。&lt;/p&gt;
&lt;h3 id=&#34;環境確認&#34;&gt;環境確認&lt;/h3&gt;
&lt;p&gt;実際に実行してみます。検証のためにデータを最小限にしています。ロードされているデータは下記の通りです。&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-sql&#34;&gt;SELECT *
WHERE {
  ?s ?p ?o .
}
LIMIT 100
OFFSET 0 
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;image-20200321142521673.png&#34; alt=&#34;image-20200321142521673&#34; style=&#34;zoom:67%;&#34; /&gt;&lt;/p&gt;
&lt;h3 id=&#34;実行&#34;&gt;実行&lt;/h3&gt;
&lt;p&gt;outputのディレクトリの作成&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;mkdir -p /home/ec2-user/output
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;awslabsからneptune-exportツールのダウンロード&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;#sudo yum -y install git
git clone https://github.com/awslabs/amazon-neptune-tools.git
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;Mavenのインストール&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;sudo wget http://repos.fedorapeople.org/repos/dchen/apache-maven/epel-apache-maven.repo -O /etc/yum.repos.d/epel-apache-maven.repo
sudo sed -i s/\$releasever/6/g /etc/yum.repos.d/epel-apache-maven.repo
sudo yum install -y apache-maven
mvn --version
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;jarファイルのbuildを実行する&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;cd /home/ec2-user/amazon-neptune-tools/neptune-export
mvn clean install
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;targetディレクトリ配下にneptune-export.jarがビルドされる&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;[ec2-user@bastin neptune-export]$ ls -l target
total 62712
drwxrwxr-x 4 ec2-user ec2-user       28 Feb 24 05:13 classes
drwxrwxr-x 3 ec2-user ec2-user       25 Feb 24 05:13 generated-sources
drwxrwxr-x 3 ec2-user ec2-user       30 Feb 24 05:13 generated-test-sources
drwxrwxr-x 2 ec2-user ec2-user       28 Feb 24 05:13 maven-archiver
drwxrwxr-x 3 ec2-user ec2-user       35 Feb 24 05:13 maven-status
-rw-rw-r-- 1 ec2-user ec2-user   202719 Feb 24 05:13 neptune-export-1.0-SNAPSHOT.jar
-rw-rw-r-- 1 ec2-user ec2-user 64006996 Feb 24 05:14 neptune-export.jar
drwxrwxr-x 2 ec2-user ec2-user     4096 Feb 24 05:13 surefire-reports
drwxrwxr-x 3 ec2-user ec2-user       17 Feb 24 05:13 test-classes
[ec2-user@bastin neptune-export]$ 
&lt;/code&gt;&lt;/pre&gt;
&lt;h4 id=&#34;neptune-exportshの実行&#34;&gt;neptune-export.shの実行&lt;/h4&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;cd /home/ec2-user/amazon-neptune-tools/neptune-export
sh ./bin/neptune-export.sh export-rdf -e neptestdb.xxxxxxxxx.ap-northeast-1.neptune.amazonaws.com -d /home/ec2-user/output
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;※bin配下ではなく、一つ上のneptune-exportで実行する必要がある。neptune-export.jarを検索した上で変数に格納しているため。&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;jar=$(find . -name neptune-export.jar)
java -jar ${jar} &amp;quot;$@&amp;quot;
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;※neptuneのインスタンス名を指定しますが、「https」は抜いてください。怒られます。&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;Completed export-rdf in 0 seconds
An error occurred while exporting from Neptune:
java.lang.RuntimeException: org.eclipse.rdf4j.query.QueryEvaluationException: https: Name or service not known
	at com.amazonaws.services.neptune.rdf.NeptuneSparqlClient.executeQuery(NeptuneSparqlClient.java:166)
	at com.amazonaws.services.neptune.rdf.io.ExportRdfGraphJob.execute(ExportRdfGraphJob.java:31)
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;実行後は&lt;code&gt;output&lt;/code&gt;ディレクトリ配下にttlが出力されています。トリプルは一致していますね。&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;cd /home/ec2-user/output/1584768727668/statements
[ec2-user@bastin statements]$ cat statements-0.ttl 

&amp;lt;http://aws.amazon.com/neptune/a&amp;gt; &amp;lt;http://xmlns.com/foaf/0.1/interest&amp;gt; &amp;lt;http://dbpedia.org/resource/Satomi_Ishihara&amp;gt; .
&amp;lt;http://aws.amazon.com/neptune/b&amp;gt; &amp;lt;http://xmlns.com/foaf/0.1/interest&amp;gt; &amp;lt;http://dbpedia.org/resource/Haruka_Ayase&amp;gt; .
&amp;lt;http://aws.amazon.com/neptune/c&amp;gt; &amp;lt;http://xmlns.com/foaf/0.1/interest&amp;gt; &amp;lt;http://dbpedia.org/resource/Honda_Tsubasa&amp;gt; .
&amp;lt;http://aws.amazon.com/neptune/d&amp;gt; &amp;lt;http://xmlns.com/foaf/0.1/interest&amp;gt; &amp;lt;http://dbpedia.org/resource/Haruka_Ayase&amp;gt; .
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;出力可能なフォーマット「turtle（デフォルト）」「nquads」「json(neptuneStreamsJson)」となります。&lt;/p&gt;
&lt;p&gt;json(neptuneStreamsJson)の場合はこうなりました。&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;[ec2-user@bastin neptune-export]$ sh ./bin/neptune-export.sh export-rdf --format neptuneStreamsJson -e neptestdb.xxxxxxxxx.ap-northeast-1.neptune.amazonaws.com -d /home/ec2-user/output
Creating statement files

/home/ec2-user/output/1584769323164

[ec2-user@bastin statements]$ cat statements-0.json | jq
{
  &amp;quot;eventId&amp;quot;: {
    &amp;quot;commitNum&amp;quot;: -1,
    &amp;quot;opNum&amp;quot;: 0
  },
  &amp;quot;data&amp;quot;: {
    &amp;quot;stmt&amp;quot;: &amp;quot;&amp;lt;http://aws.amazon.com/neptune/a&amp;gt; &amp;lt;http://xmlns.com/foaf/0.1/interest&amp;gt; &amp;lt;http://dbpedia.org/resource/Satomi_Ishihara&amp;gt; .&amp;quot;
  },
  &amp;quot;op&amp;quot;: &amp;quot;ADD&amp;quot;
}
{
  &amp;quot;eventId&amp;quot;: {
    &amp;quot;commitNum&amp;quot;: -1,
    &amp;quot;opNum&amp;quot;: 0
  },
  &amp;quot;data&amp;quot;: {
    &amp;quot;stmt&amp;quot;: &amp;quot;&amp;lt;http://aws.amazon.com/neptune/b&amp;gt; &amp;lt;http://xmlns.com/foaf/0.1/interest&amp;gt; &amp;lt;http://dbpedia.org/resource/Haruka_Ayase&amp;gt; .&amp;quot;
  },
  &amp;quot;op&amp;quot;: &amp;quot;ADD&amp;quot;
}
{
  &amp;quot;eventId&amp;quot;: {
    &amp;quot;commitNum&amp;quot;: -1,
    &amp;quot;opNum&amp;quot;: 0
  },
  &amp;quot;data&amp;quot;: {
    &amp;quot;stmt&amp;quot;: &amp;quot;&amp;lt;http://aws.amazon.com/neptune/c&amp;gt; &amp;lt;http://xmlns.com/foaf/0.1/interest&amp;gt; &amp;lt;http://dbpedia.org/resource/Honda_Tsubasa&amp;gt; .&amp;quot;
  },
  &amp;quot;op&amp;quot;: &amp;quot;ADD&amp;quot;
}
{
  &amp;quot;eventId&amp;quot;: {
    &amp;quot;commitNum&amp;quot;: -1,
    &amp;quot;opNum&amp;quot;: 0
  },
  &amp;quot;data&amp;quot;: {
    &amp;quot;stmt&amp;quot;: &amp;quot;&amp;lt;http://aws.amazon.com/neptune/d&amp;gt; &amp;lt;http://xmlns.com/foaf/0.1/interest&amp;gt; &amp;lt;http://dbpedia.org/resource/Haruka_Ayase&amp;gt; .&amp;quot;
  },
  &amp;quot;op&amp;quot;: &amp;quot;ADD&amp;quot;
}
&lt;/code&gt;&lt;/pre&gt;
&lt;h3 id=&#34;余談&#34;&gt;余談&lt;/h3&gt;
&lt;p&gt;最初はエラーが発生して正常完了出来なかったのですが、Stack Overflowに投稿したら修正してくれました。助かりました。&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;amazon web services - regarding about export of neptune data - Stack Overflow &lt;a href=&#34;https://stackoverflow.com/questions/60429428/regarding-about-export-of-neptune-data&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;https://stackoverflow.com/questions/60429428/regarding-about-export-of-neptune-data&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
</description>
    </item>
    
    <item>
      <title>LODデータの作成方法の参考リンク</title>
      <link>/loddata-how-to-create-link.html</link>
      <pubDate>Tue, 10 Mar 2020 00:00:00 +0000</pubDate>
      <guid>/loddata-how-to-create-link.html</guid>
      <description>&lt;p&gt;Linked Open Data（リンクト・オープン・データ、略名: LOD）の公開方法についてまとめているリンク集。ExcelデータやRDBMSに格納されている構造データ、CSVデータをどのようにLOD化するのかイメージ付いていなかったが、これを見ればなんとなく出来る感じがする。&lt;/p&gt;
&lt;iframe src=&#34;//www.slideshare.net/slideshow/embed_code/key/5LXJyTnPsifaaZ&#34; width=&#34;595&#34; height=&#34;485&#34; frameborder=&#34;0&#34; marginwidth=&#34;0&#34; marginheight=&#34;0&#34; scrolling=&#34;no&#34; style=&#34;border:1px solid #CCC; border-width:1px; margin-bottom:5px; max-width: 100%;&#34; allowfullscreen&gt; &lt;/iframe&gt; &lt;div style=&#34;margin-bottom:5px&#34;&gt; &lt;strong&gt; &lt;a href=&#34;//www.slideshare.net/fuyukoitomatsumura/lod5lod&#34; title=&#34;LOD連続講義 第5回「LODの作り方・使い方」&#34; target=&#34;_blank&#34;&gt;LOD連続講義 第5回「LODの作り方・使い方」&lt;/a&gt; &lt;/strong&gt; from &lt;strong&gt;&lt;a href=&#34;https://www.slideshare.net/fuyukoitomatsumura&#34; target=&#34;_blank&#34;&gt;Fuyuko Matsumura&lt;/a&gt;&lt;/strong&gt; &lt;/div&gt;
&lt;iframe src=&#34;//www.slideshare.net/slideshow/embed_code/key/3Dosyw4nsFRLB8&#34; width=&#34;595&#34; height=&#34;485&#34; frameborder=&#34;0&#34; marginwidth=&#34;0&#34; marginheight=&#34;0&#34; scrolling=&#34;no&#34; style=&#34;border:1px solid #CCC; border-width:1px; margin-bottom:5px; max-width: 100%;&#34; allowfullscreen&gt; &lt;/iframe&gt; &lt;div style=&#34;margin-bottom:5px&#34;&gt; &lt;strong&gt; &lt;a href=&#34;//www.slideshare.net/KoujiKozaki/20140823kozaki-v2&#34; title=&#34;LOD技術の概要と LinkData.orgを用いたLOD公開&#34; target=&#34;_blank&#34;&gt;LOD技術の概要と LinkData.orgを用いたLOD公開&lt;/a&gt; &lt;/strong&gt; from &lt;strong&gt;&lt;a href=&#34;https://www.slideshare.net/KoujiKozaki&#34; target=&#34;_blank&#34;&gt;Kouji Kozaki&lt;/a&gt;&lt;/strong&gt; &lt;/div&gt;
&lt;iframe src=&#34;//www.slideshare.net/slideshow/embed_code/key/hu8jC7ymKp4hrm&#34; width=&#34;595&#34; height=&#34;485&#34; frameborder=&#34;0&#34; marginwidth=&#34;0&#34; marginheight=&#34;0&#34; scrolling=&#34;no&#34; style=&#34;border:1px solid #CCC; border-width:1px; margin-bottom:5px; max-width: 100%;&#34; allowfullscreen&gt; &lt;/iframe&gt; &lt;div style=&#34;margin-bottom:5px&#34;&gt; &lt;strong&gt; &lt;a href=&#34;//www.slideshare.net/KoujiKozaki/csvlod&#34; title=&#34;CSVファイルをLODとして公開するデータソン&#34; target=&#34;_blank&#34;&gt;CSVファイルをLODとして公開するデータソン&lt;/a&gt; &lt;/strong&gt; from &lt;strong&gt;&lt;a href=&#34;https://www.slideshare.net/KoujiKozaki&#34; target=&#34;_blank&#34;&gt;Kouji Kozaki&lt;/a&gt;&lt;/strong&gt; &lt;/div&gt;
&lt;iframe src=&#34;//www.slideshare.net/slideshow/embed_code/key/FVF9EJgwtCq4Dt&#34; width=&#34;595&#34; height=&#34;485&#34; frameborder=&#34;0&#34; marginwidth=&#34;0&#34; marginheight=&#34;0&#34; scrolling=&#34;no&#34; style=&#34;border:1px solid #CCC; border-width:1px; margin-bottom:5px; max-width: 100%;&#34; allowfullscreen&gt; &lt;/iframe&gt; &lt;div style=&#34;margin-bottom:5px&#34;&gt; &lt;strong&gt; &lt;a href=&#34;//www.slideshare.net/machimasuoka/ss-42456061&#34; title=&#34;LODオープンデータのつくりかたと項目名のつけかた&#34; target=&#34;_blank&#34;&gt;LODオープンデータのつくりかたと項目名のつけかた&lt;/a&gt; &lt;/strong&gt; from &lt;strong&gt;&lt;a href=&#34;https://www.slideshare.net/machimasuoka&#34; target=&#34;_blank&#34;&gt;machi takahashi&lt;/a&gt;&lt;/strong&gt; &lt;/div&gt;
</description>
    </item>
    
    <item>
      <title>SPARQLを使用して英語版DBpediaからディープインパクトの始祖を辿る</title>
      <link>/sparql-graph-dbpedia-en-search.html</link>
      <pubDate>Tue, 25 Feb 2020 00:00:00 +0000</pubDate>
      <guid>/sparql-graph-dbpedia-en-search.html</guid>
      <description>&lt;h3 id=&#34;はじめに&#34;&gt;はじめに&lt;/h3&gt;
&lt;p&gt;下記記事のリベンジ記事です。有馬記念の勝ち馬からサラブレッドの始祖まで辿ろうとしたが、dbpedia-jp(jp.wikipedia.org)のURI誤りで途中で終わってしまった。&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;日本語版DBPediaで有馬記念の勝ち馬からサラブレッドの始祖を辿る | my opinion is my own &lt;a href=&#34;https://zatoima.github.io/sparql-graph-thoroughbred-search.html&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;https://zatoima.github.io/sparql-graph-thoroughbred-search.html&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;リベンジとして、英語版のDBPediaを使いディープインパクトを起点として始祖まで辿ろうと思います。&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;競馬で走る馬はサラブレッドと呼ばれますが、血統を辿ると全て3頭の馬(ダーレーアラビアン、ゴドルフィンアラビアン、バイアリーターク)にさかのぼると言います。&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;3大始祖と世界の血統：サラブレッド講座　JRA &lt;a href=&#34;http://www.jra.go.jp/kouza/thoroughbred/founder/&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;http://www.jra.go.jp/kouza/thoroughbred/founder/&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/blockquote&gt;
&lt;h3 id=&#34;dbpedia英語版&#34;&gt;DBpedia（英語版）&lt;/h3&gt;
&lt;blockquote&gt;
&lt;p&gt;Virtuoso SPARQL Query Editor &lt;a href=&#34;https://dbpedia.org/sparql&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;https://dbpedia.org/sparql&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h3 id=&#34;sparqlクエリ&#34;&gt;SPARQLクエリ&lt;/h3&gt;
&lt;p&gt;最終的にこうしました。&lt;/p&gt;
&lt;p&gt;述語部分はsireとなります。父という意味です。リーディングサイアー (Leading Sire)と言いますね。&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;PREFIX dbpedia: &amp;lt;http://dbpedia.org/ontology/&amp;gt;

select ?parent_gen1_name ?parent_gen2_name ?parent_gen3_name ?parent_gen4_name ?parent_gen5_name ?parent_gen6_name ?parent_gen7_name ?parent_gen8_name ?parent_gen9_name ?parent_gen10_name ?parent_gen11_name ?parent_gen12_name ?parent_gen13_name ?parent_gen14_name ?parent_gen15_name ?parent_gen16_name ?parent_gen17_name ?parent_gen18_name ?parent_gen19_name ?parent_gen20_name ?parent_gen21_name ?parent_gen22_name ?parent_gen23_name ?parent_gen24_name ?parent_gen25_name
where { 
  &amp;lt;http://dbpedia.org/resource/Deep_Impact_(horse)&amp;gt; dbpedia:sire ?parent_gen1_name . 
   ?parent_gen1_name dbpedia:sire ?parent_gen2_name . #Sunday_Silence
   ?parent_gen2_name dbpedia:sire ?parent_gen3_name . #Halo
   ?parent_gen3_name dbpedia:sire ?parent_gen4_name . #Hail_To_Reason
   ?parent_gen4_name dbpedia:sire ?parent_gen5_name . #Turn-To
   ?parent_gen5_name dbpedia:sire ?parent_gen6_name . #Royal_Charger
   ?parent_gen6_name dbpedia:sire ?parent_gen7_name . #Nearco
   ?parent_gen7_name dbpedia:sire ?parent_gen8_name . #Pharos
   ?parent_gen8_name dbpedia:sire ?parent_gen9_name . #Phalaris
   ?parent_gen9_name dbpedia:sire ?parent_gen10_name . #Polymelus
   ?parent_gen10_name dbpedia:sire ?parent_gen11_name . #Cyllene
   ?parent_gen11_name dbpedia:sire ?parent_gen12_name . #Bona_Vista
   ?parent_gen12_name dbpedia:sire ?parent_gen13_name . #Bend_Or
   ?parent_gen13_name dbpedia:sire ?parent_gen14_name . #Doncaster
   ?parent_gen14_name dbpedia:sire ?parent_gen15_name . #The_Baron
   ?parent_gen15_name dbpedia:sire ?parent_gen16_name . #Birdcatcher
   ?parent_gen16_name dbpedia:wikiPageRedirects ?Birdcatcher_wpr .
   ?Birdcatcher_wpr dbo:sire ?parent_gen17_name . #Sir_Hercules
   ?parent_gen17_name dbpedia:sire ?parent_gen18_name . #Whalebone
   ?parent_gen18_name dbpedia:sire ?parent_gen19_name . #Waxy
   ?parent_gen19_name dbpedia:sire ?parent_gen20_name . #Potoooooooo
   ?parent_gen20_name dbpedia:sire ?parent_gen21_name . #Eclipse
   ?parent_gen21_name dbpedia:sire ?parent_gen22_name . #Marske
   ?parent_gen22_name dbpedia:sire ?parent_gen23_name . #Squirt
   ?parent_gen23_name dbpedia:sire ?parent_gen24_name . #Bartlets_Childers
   ?parent_gen24_name dbpedia:wikiPageRedirects ?Bartlets_Childers .
   ?Bartlets_Childers dbo:sire ?parent_gen25_name . #Darley_Arabian
}

&lt;/code&gt;&lt;/pre&gt;
&lt;h3 id=&#34;補足&#34;&gt;補足&lt;/h3&gt;
&lt;p&gt;&lt;code&gt;Birdcatcher&lt;/code&gt;と&lt;code&gt;Bartlets_Childers&lt;/code&gt;には他の競走馬にある&lt;code&gt;http://dbpedia.org/ontology/sire&lt;/code&gt;プロパティがなく、そこからは親を辿れません。&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;PREFIX dbpedia: &amp;lt;http://dbpedia.org/ontology/&amp;gt;

select *
where { 
  &amp;lt;http://dbpedia.org/resource/Birdcatcher&amp;gt; ?p ?o .
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;















&lt;figure  &gt;
  &lt;div class=&#34;d-flex justify-content-center&#34;&gt;
    &lt;div class=&#34;w-100&#34; &gt;&lt;img alt=&#34;image-20200222161400597&#34; srcset=&#34;
               /image-20200222161400597_huf3eb81406e48120cbe702b7ba42cbb4b_71577_0fff45d89b5db62f30847f277887b053.png 400w,
               /image-20200222161400597_huf3eb81406e48120cbe702b7ba42cbb4b_71577_e1d2e160ffb4728f58fc817f91b3e3cc.png 760w,
               /image-20200222161400597_huf3eb81406e48120cbe702b7ba42cbb4b_71577_1200x1200_fit_lanczos_3.png 1200w&#34;
               src=&#34;/image-20200222161400597_huf3eb81406e48120cbe702b7ba42cbb4b_71577_0fff45d89b5db62f30847f277887b053.png&#34;
               width=&#34;760&#34;
               height=&#34;201&#34;
               loading=&#34;lazy&#34; data-zoomable /&gt;&lt;/div&gt;
  &lt;/div&gt;&lt;/figure&gt;
&lt;/p&gt;
&lt;p&gt;述語が&lt;code&gt;http://dbpedia.org/ontology/wikiPageRedirects&lt;/code&gt;の&lt;code&gt;http://dbpedia.org/resource/Birdcatcher_(horse)&lt;/code&gt;に行くと&lt;code&gt;dbo:sire&lt;/code&gt;がありましたのでこちらのPropertyを使用します。&lt;/p&gt;
&lt;p&gt;こうすることでsireを取得することが出来ました。&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;PREFIX dbpedia: &amp;lt;http://dbpedia.org/ontology/&amp;gt;

select ?Birdcatcher_sire
where { 
  &amp;lt;http://dbpedia.org/resource/Birdcatcher&amp;gt; dbpedia:wikiPageRedirects ?Birdcatcher_wpr .
  ?Birdcatcher_wpr dbo:sire ?Birdcatcher_sire
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;















&lt;figure  &gt;
  &lt;div class=&#34;d-flex justify-content-center&#34;&gt;
    &lt;div class=&#34;w-100&#34; &gt;&lt;img alt=&#34;image-20200222165056244&#34; srcset=&#34;
               /image-20200222165056244_hub122273dd97367be71e9fd6c7c0922c4_10344_36f6b7917ce36e4354d209894a72f246.png 400w,
               /image-20200222165056244_hub122273dd97367be71e9fd6c7c0922c4_10344_90211bd5c4f71911f939cbe7508b34fa.png 760w,
               /image-20200222165056244_hub122273dd97367be71e9fd6c7c0922c4_10344_1200x1200_fit_lanczos_3.png 1200w&#34;
               src=&#34;/image-20200222165056244_hub122273dd97367be71e9fd6c7c0922c4_10344_36f6b7917ce36e4354d209894a72f246.png&#34;
               width=&#34;522&#34;
               height=&#34;107&#34;
               loading=&#34;lazy&#34; data-zoomable /&gt;&lt;/div&gt;
  &lt;/div&gt;&lt;/figure&gt;
&lt;/p&gt;
&lt;h3 id=&#34;結果&#34;&gt;結果&lt;/h3&gt;
&lt;p&gt;最終的な結果はこうなりました。ディープインパクトの始祖は&lt;a href=&#34;https://ja.wikipedia.org/wiki/%E3%83%80%E3%83%BC%E3%83%AC%E3%83%BC%E3%82%A2%E3%83%A9%E3%83%93%E3%82%A2%E3%83%B3&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;Darley_Arabian&lt;/a&gt;となります！&lt;/p&gt;
&lt;table&gt;
&lt;thead&gt;
&lt;tr&gt;
&lt;th&gt;世代&lt;/th&gt;
&lt;th&gt;馬名&lt;/th&gt;
&lt;/tr&gt;
&lt;/thead&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;1&lt;/td&gt;
&lt;td&gt;Sunday_Silence&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;2&lt;/td&gt;
&lt;td&gt;Halo&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;3&lt;/td&gt;
&lt;td&gt;Hail_To_Reason&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;4&lt;/td&gt;
&lt;td&gt;Turn-To&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;5&lt;/td&gt;
&lt;td&gt;Royal_Charger&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;6&lt;/td&gt;
&lt;td&gt;Nearco&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;7&lt;/td&gt;
&lt;td&gt;Pharos&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;8&lt;/td&gt;
&lt;td&gt;Phalaris&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;9&lt;/td&gt;
&lt;td&gt;Polymelus&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;10&lt;/td&gt;
&lt;td&gt;Cyllene&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;11&lt;/td&gt;
&lt;td&gt;Bona_Vista&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;12&lt;/td&gt;
&lt;td&gt;Bend_Or&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;13&lt;/td&gt;
&lt;td&gt;Doncaster&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;14&lt;/td&gt;
&lt;td&gt;Stockwell&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;15&lt;/td&gt;
&lt;td&gt;The_Baron&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;16&lt;/td&gt;
&lt;td&gt;Birdcatcher&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;17&lt;/td&gt;
&lt;td&gt;Sir_Hercules&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;18&lt;/td&gt;
&lt;td&gt;Whalebone&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;19&lt;/td&gt;
&lt;td&gt;Waxy&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;20&lt;/td&gt;
&lt;td&gt;Potoooooooo&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;21&lt;/td&gt;
&lt;td&gt;Eclipse&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;22&lt;/td&gt;
&lt;td&gt;Marske&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;23&lt;/td&gt;
&lt;td&gt;Squirt&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;24&lt;/td&gt;
&lt;td&gt;Bartlet&amp;rsquo;s_Childers&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;25&lt;/td&gt;
&lt;td&gt;Darley_Arabian&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
</description>
    </item>
    
    <item>
      <title>SPARQLを使用して日本語版DBPediaから有馬記念の勝ち馬の始祖を辿る</title>
      <link>/sparql-graph-thoroughbred-search.html</link>
      <pubDate>Sat, 22 Feb 2020 00:00:00 +0000</pubDate>
      <guid>/sparql-graph-thoroughbred-search.html</guid>
      <description>&lt;h2 id=&#34;はじめに&#34;&gt;はじめに&lt;/h2&gt;
&lt;p&gt;DBpediaはWikipediaから情報を抽出してLOD (Linked Open Data)として公開するコミュニティプロジェクトで、英語版と日本語版があります。日本語版は&lt;code&gt;ja.wikipedia.org&lt;/code&gt;からデータを抽出しています。抽出したデータは構造化データ(RDF)として格納されています。RDFストアに対してはSPARQLというクエリ言語で情報を取得することが出来ます。今回は日本語版のDBpediaで情報を取得したいと思います。&lt;/p&gt;
&lt;iframe src=&#34;//www.slideshare.net/slideshow/embed_code/key/8lHvTVasgBvWtE&#34; width=&#34;595&#34; height=&#34;485&#34; frameborder=&#34;0&#34; marginwidth=&#34;0&#34; marginheight=&#34;0&#34; scrolling=&#34;no&#34; style=&#34;border:1px solid #CCC; border-width:1px; margin-bottom:5px; max-width: 100%;&#34; allowfullscreen&gt; &lt;/iframe&gt; &lt;div style=&#34;margin-bottom:5px&#34;&gt; &lt;strong&gt; &lt;a href=&#34;//www.slideshare.net/takeda/what-isdpbedia&#34; title=&#34;DBpedia Japaneseとは？&#34; target=&#34;_blank&#34;&gt;DBpedia Japaneseとは？&lt;/a&gt; &lt;/strong&gt; from &lt;strong&gt;&lt;a href=&#34;https://www.slideshare.net/takeda&#34; target=&#34;_blank&#34;&gt;National Institute of Informatics (NII)&lt;/a&gt;&lt;/strong&gt; &lt;/div&gt;
## SPARQLエンドポイント
&lt;p&gt;DBpediaのエンドポイントはこちらになります。&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Virtuoso SPARQL Query Editor &lt;a href=&#34;http://ja.dbpedia.org/sparql&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;http://ja.dbpedia.org/sparql&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2 id=&#34;有馬記念の勝ち馬に関する情報&#34;&gt;有馬記念の勝ち馬に関する情報&lt;/h2&gt;
&lt;h3 id=&#34;プロパティを調べる&#34;&gt;プロパティを調べる&lt;/h3&gt;
&lt;p&gt;勝ち馬を軸にまずはどんなプロパティを持っているかどうかを調べてみる。&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-SQL&#34;&gt;select distinct ?p {
  {
    ?name prop-ja:wikiPageUsesTemplate template-ja:有馬記念勝ち馬.
  }

  ?name rdfs:label ?label ;
    ?p ?o .
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;image-20200222142308680.png&#34; alt=&#34;image-20200222142308680&#34; style=&#34;zoom:50%;&#34; /&gt;&lt;/p&gt;
&lt;h3 id=&#34;サンプルを確認&#34;&gt;サンプルを確認&lt;/h3&gt;
&lt;p&gt;勝ち馬を軸にまずはどんなプロパティを持っているかのサンプル値を出力する。&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-SQL&#34;&gt;select ?p (SAMPLE(?o) AS ?sample_value)
WHERE {
  {
    ?name prop-ja:wikiPageUsesTemplate template-ja:有馬記念勝ち馬.
  }

  ?name rdfs:label ?label ;
    ?p ?o .
} order by (?p)
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;image-20200222142141557.png&#34; alt=&#34;image-20200222142141557&#34; style=&#34;zoom:50%;&#34; /&gt;&lt;/p&gt;
&lt;h3 id=&#34;血統を辿る&#34;&gt;血統を辿る&lt;/h3&gt;
&lt;p&gt;次に父の父の父の父・・・・・という感じで血統を調べていき、どこまで辿れるかやってみます。&lt;/p&gt;
&lt;p&gt;RDBMSに格納されているデータで同じように特定の馬の父の父の父とした場合、同じテーブルに格納されている値をサブクエリ(副問合せ)で結合して取得すると思いますが、おそらく数世代先の馬を調べる時に性能限界が来ると思います。何度もjoinする必要があるので。&lt;/p&gt;
&lt;p&gt;一方、RDFストアやSPARQLクエリは関係性を抽出することに優れた言語のため、特にリレーション抽出対象が増えたとしてもクエリの性能に影響を与えません。&lt;/p&gt;
&lt;p&gt;ちなみに競馬で走る馬はサラブレッドと呼ばれますが、血統を辿ると全て3頭の馬(ダーレーアラビアン、ゴドルフィンアラビアン、バイアリーターク)にさかのぼると言います。**&lt;u&gt;WikipediaやDBPediaのデータが正しければ&lt;/u&gt;**おそらくこの3頭のどれかには辿り付くはずです。&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;3大始祖と世界の血統：サラブレッド講座　JRA &lt;a href=&#34;http://www.jra.go.jp/kouza/thoroughbred/founder/&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;http://www.jra.go.jp/kouza/thoroughbred/founder/&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h4 id=&#34;第1世代&#34;&gt;第1世代&lt;/h4&gt;
&lt;p&gt;まずは勝ち馬の父を調べてみる。&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-SQL&#34;&gt;select distinct ?parent_f_name (count(?parent_f_name) AS ?count) {
  {
    ?name prop-ja:wikiPageUsesTemplate template-ja:有馬記念勝ち馬.
  }

  ?name rdfs:label ?label ;
    prop-ja:父 ?parent_f_name .
} ORDER BY DESC(?count)
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;image-20200222142450812.png&#34; alt=&#34;image-20200222142450812&#34; style=&#34;zoom:50%;&#34; /&gt;&lt;/p&gt;
&lt;h4 id=&#34;第2世代&#34;&gt;第2世代&lt;/h4&gt;
&lt;p&gt;勝ち馬の父の父を調べてみる&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-SQL&#34;&gt;select distinct ?parent_f_f_name (count(?parent_f_f_name) AS ?count) {
  {
    ?name prop-ja:wikiPageUsesTemplate template-ja:有馬記念勝ち馬.
  }

  ?name rdfs:label ?label ;
    prop-ja:父 ?parent_f_name .
   ?parent_f_name prop-ja:父 ?parent_f_f_name .
} ORDER BY DESC(?count)
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;image-20200222144157168.png&#34; alt=&#34;image-20200222144157168&#34; style=&#34;zoom:50%;&#34; /&gt;&lt;/p&gt;
&lt;h4 id=&#34;第18世代&#34;&gt;第18世代&lt;/h4&gt;
&lt;p&gt;一気に飛んで第18世代です。こんな感じでどこまで辿れるか試してみます。&lt;code&gt;ホエルボーン&lt;/code&gt;は&lt;code&gt;1807年-1831年&lt;/code&gt;のイギリス馬です。現時点で&lt;code&gt;18世代&lt;/code&gt;遡っています。&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-SQL&#34;&gt;select distinct ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name (count(?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name) AS ?count) {
  {
    ?name prop-ja:wikiPageUsesTemplate template-ja:有馬記念勝ち馬.
  }

  ?name rdfs:label ?label ;
    prop-ja:父 ?parent_f_name .
   ?parent_f_name prop-ja:父 ?parent_f_f_name .
   ?parent_f_f_name prop-ja:父 ?parent_f_f_f_name .
   ?parent_f_f_f_name prop-ja:父 ?parent_f_f_f_f_name .
   ?parent_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
} ORDER BY DESC(?count)
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;image-20200222144259529.png&#34; alt=&#34;image-20200222144259529&#34; style=&#34;zoom:50%;&#34; /&gt;&lt;/p&gt;
&lt;h4 id=&#34;第19世代&#34;&gt;第19世代&lt;/h4&gt;
&lt;pre&gt;&lt;code class=&#34;language-SQL&#34;&gt;
select distinct ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name (count(?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name) AS ?count) {
  {
    ?name prop-ja:wikiPageUsesTemplate template-ja:有馬記念勝ち馬.
  }

  ?name rdfs:label ?label ;
    prop-ja:父 ?parent_f_name .
   ?parent_f_name prop-ja:父 ?parent_f_f_name .
   ?parent_f_f_name prop-ja:父 ?parent_f_f_f_name .
   ?parent_f_f_f_name prop-ja:父 ?parent_f_f_f_f_name .
   ?parent_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
} ORDER BY DESC(?count)

&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;image-20200222145756017.png&#34; alt=&#34;image-20200222145756017&#34; style=&#34;zoom:50%;&#34; /&gt;&lt;/p&gt;
&lt;h4 id=&#34;第21世代&#34;&gt;第21世代&lt;/h4&gt;
&lt;p&gt;21世代まで遡ってみると、ワクシーという一頭に絞られてしまいました。ホエールボーンの父がワクシーです。&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-SQL&#34;&gt;select distinct ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name (count(?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name) AS ?count) {
  {
    ?name prop-ja:wikiPageUsesTemplate template-ja:有馬記念勝ち馬.
  }

  ?name rdfs:label ?label ;
    prop-ja:父 ?parent_f_name .
   ?parent_f_name prop-ja:父 ?parent_f_f_name .
   ?parent_f_f_name prop-ja:父 ?parent_f_f_f_name .
   ?parent_f_f_f_name prop-ja:父 ?parent_f_f_f_f_name .
   ?parent_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
} ORDER BY DESC(?count)
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;image-20200222150544445.png&#34; alt=&#34;image-20200222150544445&#34; style=&#34;zoom:50%;&#34; /&gt;&lt;/p&gt;
&lt;h4 id=&#34;第22世代&#34;&gt;第22世代&lt;/h4&gt;
&lt;p&gt;このワクシーの親を調べようとしたら出てきませんでした。&lt;a href=&#34;https://ja.wikipedia.org/wiki/%E3%83%9B%E3%82%A8%E3%83%BC%E3%83%AB%E3%83%9C%E3%83%BC%E3%83%B3&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;ホエールボーン&lt;/a&gt;の父が「&lt;a href=&#34;https://ja.wikipedia.org/wiki/%e3%83%af%e3%82%af%e3%82%b7%e3%83%bc&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;ワクシー&lt;/a&gt;」なのですが、実際のWikipediaのページは「https://ja.wikipedia.org/wiki/ワキシー」となっています。「ワクシー」と「ワキシー」でURIが異なるためこれ以上辿れないのだと推測します。&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-SQL&#34;&gt;select distinct ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name (count(?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name) AS ?count) {
  {
    ?name prop-ja:wikiPageUsesTemplate template-ja:有馬記念勝ち馬.
  }

  ?name rdfs:label ?label ;
    prop-ja:父 ?parent_f_name .
   ?parent_f_name prop-ja:父 ?parent_f_f_name .
   ?parent_f_f_name prop-ja:父 ?parent_f_f_f_name .
   ?parent_f_f_f_name prop-ja:父 ?parent_f_f_f_f_name .
   ?parent_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
} ORDER BY DESC(?count)
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;















&lt;figure  &gt;
  &lt;div class=&#34;d-flex justify-content-center&#34;&gt;
    &lt;div class=&#34;w-100&#34; &gt;&lt;img alt=&#34;image-20200222150814920&#34; srcset=&#34;
               /image-20200222150814920_huea3e1e5862ffce312077aafd6fef1018_4666_3d59f2dc6e32f928ddb9738739d3d3f3.png 400w,
               /image-20200222150814920_huea3e1e5862ffce312077aafd6fef1018_4666_34f3e06e46efc9e1c554279a9f177e1f.png 760w,
               /image-20200222150814920_huea3e1e5862ffce312077aafd6fef1018_4666_1200x1200_fit_lanczos_3.png 1200w&#34;
               src=&#34;/image-20200222150814920_huea3e1e5862ffce312077aafd6fef1018_4666_3d59f2dc6e32f928ddb9738739d3d3f3.png&#34;
               width=&#34;760&#34;
               height=&#34;57&#34;
               loading=&#34;lazy&#34; data-zoomable /&gt;&lt;/div&gt;
  &lt;/div&gt;&lt;/figure&gt;
&lt;/p&gt;
&lt;h3 id=&#34;終わりに&#34;&gt;終わりに&lt;/h3&gt;
&lt;p&gt;次は英語版でやってみます。&lt;/p&gt;
&lt;p&gt;今回は全て父を辿りましたが、他のプロパティを組み合わせて分析したいなと思いました。競馬の分析用途に自前のRDFストアを構築するということもやってみたいと思いました。&lt;/p&gt;
</description>
    </item>
    
    <item>
      <title>Amazon Neptuneのインスタンス作成からデータロード、クエリ実行までやってみる</title>
      <link>/aws-neptune-create-instance-execute-query-try.html</link>
      <pubDate>Tue, 28 Jan 2020 00:00:00 +0000</pubDate>
      <guid>/aws-neptune-create-instance-execute-query-try.html</guid>
      <description>&lt;h3 id=&#34;はじめに&#34;&gt;はじめに&lt;/h3&gt;
&lt;p&gt;AWSの完全マネージド型のグラフデータベースサービスであるNeptuneを触ってみようと思う。インスタンス作成から&lt;code&gt;RDF&lt;/code&gt;形式のデータロード、及び&lt;code&gt;SPARQL&lt;/code&gt;を使用して単純なクエリ発行までやってみる。&lt;/p&gt;
&lt;p&gt;グラフデータベースとは？Amazon Neptuneとは？については別記事でまとめたい。&lt;/p&gt;
&lt;p&gt;下記stepで実施する。&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;インスタンスの作成&lt;/li&gt;
&lt;li&gt;IAMロール作成、ロールのNeptuneへのアタッチ、S3VPCエンドポイントの設定&lt;/li&gt;
&lt;li&gt;S3からデータのロード&lt;/li&gt;
&lt;li&gt;RDF4J コンソール、HTTP REST エンドポイントを使用してロードしたデータの確認&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;前提条件&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;VPCやS3の事前作成&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&#34;インスタンスの作成&#34;&gt;インスタンスの作成&lt;/h3&gt;
&lt;h4 id=&#34;データベースの作成を選択&#34;&gt;「データベースの作成」を選択&lt;/h4&gt;
&lt;p&gt;















&lt;figure  &gt;
  &lt;div class=&#34;d-flex justify-content-center&#34;&gt;
    &lt;div class=&#34;w-100&#34; &gt;&lt;img alt=&#34;image-20200128161750382&#34; srcset=&#34;
               /image-20200128161750382_huc1bef5caecaa18884af080d11fac4700_18052_a4deff1c9784bdf7ea14fba2e4bee851.png 400w,
               /image-20200128161750382_huc1bef5caecaa18884af080d11fac4700_18052_b469bd9493d752f4ae08a0d235989e9f.png 760w,
               /image-20200128161750382_huc1bef5caecaa18884af080d11fac4700_18052_1200x1200_fit_lanczos_3.png 1200w&#34;
               src=&#34;/image-20200128161750382_huc1bef5caecaa18884af080d11fac4700_18052_a4deff1c9784bdf7ea14fba2e4bee851.png&#34;
               width=&#34;760&#34;
               height=&#34;82&#34;
               loading=&#34;lazy&#34; data-zoomable /&gt;&lt;/div&gt;
  &lt;/div&gt;&lt;/figure&gt;
&lt;/p&gt;
&lt;h4 id=&#34;db詳細の指定を入力&#34;&gt;「DB詳細の指定」を入力。&lt;/h4&gt;
&lt;p&gt;今回は現時点の最新のバージョンである「Neptune 1.0.2.1.R4」を指定。インスタンス作成後のMulti-AZへの変更は現段階では出来ないので必要に応じてこのタイミングで選択する。&lt;/p&gt;
&lt;p&gt;















&lt;figure  &gt;
  &lt;div class=&#34;d-flex justify-content-center&#34;&gt;
    &lt;div class=&#34;w-100&#34; &gt;&lt;img alt=&#34;image-20200128161848792&#34; srcset=&#34;
               /image-20200128161848792_hu30b79d516592c21096a861e854425e45_67567_0d026e54e19a1a6c8b80d5212d1b50a5.png 400w,
               /image-20200128161848792_hu30b79d516592c21096a861e854425e45_67567_8bea560d9112e6b8d150b67c7bcc8703.png 760w,
               /image-20200128161848792_hu30b79d516592c21096a861e854425e45_67567_1200x1200_fit_lanczos_3.png 1200w&#34;
               src=&#34;/image-20200128161848792_hu30b79d516592c21096a861e854425e45_67567_0d026e54e19a1a6c8b80d5212d1b50a5.png&#34;
               width=&#34;760&#34;
               height=&#34;646&#34;
               loading=&#34;lazy&#34; data-zoomable /&gt;&lt;/div&gt;
  &lt;/div&gt;&lt;/figure&gt;
&lt;/p&gt;
&lt;h4 id=&#34;続きを入力&#34;&gt;続きを入力。&lt;/h4&gt;
&lt;p&gt;RDSやAuroraと同じような入力項目。&lt;/p&gt;
&lt;p&gt;















&lt;figure  &gt;
  &lt;div class=&#34;d-flex justify-content-center&#34;&gt;
    &lt;div class=&#34;w-100&#34; &gt;&lt;img alt=&#34;image-20200128162140347&#34; srcset=&#34;
               /image-20200128162140347_huf25a14f97721853833a8649d2e35274e_59614_38069842bdbed0982b27048d252e9f8a.png 400w,
               /image-20200128162140347_huf25a14f97721853833a8649d2e35274e_59614_3def41c5b59b385aaceee471db1c5e43.png 760w,
               /image-20200128162140347_huf25a14f97721853833a8649d2e35274e_59614_1200x1200_fit_lanczos_3.png 1200w&#34;
               src=&#34;/image-20200128162140347_huf25a14f97721853833a8649d2e35274e_59614_38069842bdbed0982b27048d252e9f8a.png&#34;
               width=&#34;639&#34;
               height=&#34;511&#34;
               loading=&#34;lazy&#34; data-zoomable /&gt;&lt;/div&gt;
  &lt;/div&gt;&lt;/figure&gt;
&lt;/p&gt;
&lt;p&gt;















&lt;figure  &gt;
  &lt;div class=&#34;d-flex justify-content-center&#34;&gt;
    &lt;div class=&#34;w-100&#34; &gt;&lt;img alt=&#34;image-20200128162149794&#34; srcset=&#34;
               /image-20200128162149794_hu9d1f233a414f7698de31d3f124e0a8ed_55967_d3b6c1cacea1c18be01b6c7737cac3f1.png 400w,
               /image-20200128162149794_hu9d1f233a414f7698de31d3f124e0a8ed_55967_25df96d203125fc3f1b8c799641b5194.png 760w,
               /image-20200128162149794_hu9d1f233a414f7698de31d3f124e0a8ed_55967_1200x1200_fit_lanczos_3.png 1200w&#34;
               src=&#34;/image-20200128162149794_hu9d1f233a414f7698de31d3f124e0a8ed_55967_d3b6c1cacea1c18be01b6c7737cac3f1.png&#34;
               width=&#34;603&#34;
               height=&#34;699&#34;
               loading=&#34;lazy&#34; data-zoomable /&gt;&lt;/div&gt;
  &lt;/div&gt;&lt;/figure&gt;
&lt;/p&gt;
&lt;p&gt;















&lt;figure  &gt;
  &lt;div class=&#34;d-flex justify-content-center&#34;&gt;
    &lt;div class=&#34;w-100&#34; &gt;&lt;img alt=&#34;image-20200128162200135&#34; srcset=&#34;
               /image-20200128162200135_hu47802e594c9dd06c3f35e2035ae96824_67240_5d25170db690c4be15862ff3295ab632.png 400w,
               /image-20200128162200135_hu47802e594c9dd06c3f35e2035ae96824_67240_b78f19f682b2cacb4eea8964e35f16f8.png 760w,
               /image-20200128162200135_hu47802e594c9dd06c3f35e2035ae96824_67240_1200x1200_fit_lanczos_3.png 1200w&#34;
               src=&#34;/image-20200128162200135_hu47802e594c9dd06c3f35e2035ae96824_67240_5d25170db690c4be15862ff3295ab632.png&#34;
               width=&#34;605&#34;
               height=&#34;741&#34;
               loading=&#34;lazy&#34; data-zoomable /&gt;&lt;/div&gt;
  &lt;/div&gt;&lt;/figure&gt;
&lt;/p&gt;
&lt;p&gt;「データベースの作成」ボタンをクリック後に作成が始まるので少々待つ。&lt;/p&gt;
&lt;p&gt;















&lt;figure  &gt;
  &lt;div class=&#34;d-flex justify-content-center&#34;&gt;
    &lt;div class=&#34;w-100&#34; &gt;&lt;img alt=&#34;image-20200128162219388&#34; srcset=&#34;
               /image-20200128162219388_huffe1bee518411d9ca8ba0df68cf3a270_23692_07c6eb2a3d951556a91968f29a1316a6.png 400w,
               /image-20200128162219388_huffe1bee518411d9ca8ba0df68cf3a270_23692_348354b6d9df5a41969e6354146443f0.png 760w,
               /image-20200128162219388_huffe1bee518411d9ca8ba0df68cf3a270_23692_1200x1200_fit_lanczos_3.png 1200w&#34;
               src=&#34;/image-20200128162219388_huffe1bee518411d9ca8ba0df68cf3a270_23692_07c6eb2a3d951556a91968f29a1316a6.png&#34;
               width=&#34;760&#34;
               height=&#34;92&#34;
               loading=&#34;lazy&#34; data-zoomable /&gt;&lt;/div&gt;
  &lt;/div&gt;&lt;/figure&gt;
&lt;/p&gt;
&lt;p&gt;大体5分～10分くらいで作成は完了した。&lt;/p&gt;
&lt;p&gt;















&lt;figure  &gt;
  &lt;div class=&#34;d-flex justify-content-center&#34;&gt;
    &lt;div class=&#34;w-100&#34; &gt;&lt;img alt=&#34;image-20200128162946898&#34; srcset=&#34;
               /image-20200128162946898_hue3e5b73f441a0f37f479cbd81e6e85bf_23939_9cd52b7555b8569748ce950a0b726c13.png 400w,
               /image-20200128162946898_hue3e5b73f441a0f37f479cbd81e6e85bf_23939_ec363e832b1d94006ba66bc06810bc0f.png 760w,
               /image-20200128162946898_hue3e5b73f441a0f37f479cbd81e6e85bf_23939_1200x1200_fit_lanczos_3.png 1200w&#34;
               src=&#34;/image-20200128162946898_hue3e5b73f441a0f37f479cbd81e6e85bf_23939_9cd52b7555b8569748ce950a0b726c13.png&#34;
               width=&#34;760&#34;
               height=&#34;93&#34;
               loading=&#34;lazy&#34; data-zoomable /&gt;&lt;/div&gt;
  &lt;/div&gt;&lt;/figure&gt;
&lt;/p&gt;
&lt;h3 id=&#34;iamロールとs3vpcエンドポイントの設定&#34;&gt;「IAMロールとS3VPCエンドポイントの設定」&lt;/h3&gt;
&lt;p&gt;データロードのための下準備としてIAMロールとS3 VPCエンドポイントの設定を行う。&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;前提条件: IAM ロールと Amazon S3 アクセス - Amazon Neptune &lt;a href=&#34;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/bulk-load-tutorial-IAM.html&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/bulk-load-tutorial-IAM.html&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;IAMの画面から「ロールの作成」を選択&lt;/p&gt;
&lt;p&gt;















&lt;figure  &gt;
  &lt;div class=&#34;d-flex justify-content-center&#34;&gt;
    &lt;div class=&#34;w-100&#34; &gt;&lt;img alt=&#34;image-20200128163143004&#34; srcset=&#34;
               /image-20200128163143004_hu6a9e01e041e8319945efe3b0e0e40280_17678_ca6c0461807c54784e39305df4c32ab1.png 400w,
               /image-20200128163143004_hu6a9e01e041e8319945efe3b0e0e40280_17678_0532571d748fb1165578ae55a30bab7d.png 760w,
               /image-20200128163143004_hu6a9e01e041e8319945efe3b0e0e40280_17678_1200x1200_fit_lanczos_3.png 1200w&#34;
               src=&#34;/image-20200128163143004_hu6a9e01e041e8319945efe3b0e0e40280_17678_ca6c0461807c54784e39305df4c32ab1.png&#34;
               width=&#34;568&#34;
               height=&#34;206&#34;
               loading=&#34;lazy&#34; data-zoomable /&gt;&lt;/div&gt;
  &lt;/div&gt;&lt;/figure&gt;
&lt;/p&gt;
&lt;p&gt;S3を選択&lt;/p&gt;
&lt;p&gt;















&lt;figure  &gt;
  &lt;div class=&#34;d-flex justify-content-center&#34;&gt;
    &lt;div class=&#34;w-100&#34; &gt;&lt;img alt=&#34;image-20200128163255012&#34; srcset=&#34;
               /image-20200128163255012_hufa1dd30bc5b881455c779da5ccff79f4_109360_e530cea38a00cc7c30392403be7216bc.png 400w,
               /image-20200128163255012_hufa1dd30bc5b881455c779da5ccff79f4_109360_6e5c92fc9ab853a2da52163cd0471c68.png 760w,
               /image-20200128163255012_hufa1dd30bc5b881455c779da5ccff79f4_109360_1200x1200_fit_lanczos_3.png 1200w&#34;
               src=&#34;/image-20200128163255012_hufa1dd30bc5b881455c779da5ccff79f4_109360_e530cea38a00cc7c30392403be7216bc.png&#34;
               width=&#34;668&#34;
               height=&#34;760&#34;
               loading=&#34;lazy&#34; data-zoomable /&gt;&lt;/div&gt;
  &lt;/div&gt;&lt;/figure&gt;
&lt;/p&gt;
&lt;p&gt;「&lt;code&gt;AmazonS3ReadOnlyAccess&lt;/code&gt;」を選択してポリシーをアタッチする。&lt;/p&gt;
&lt;p&gt;















&lt;figure  &gt;
  &lt;div class=&#34;d-flex justify-content-center&#34;&gt;
    &lt;div class=&#34;w-100&#34; &gt;&lt;img alt=&#34;image-20200128171213697&#34; srcset=&#34;
               /image-20200128171213697_hu22ffba04a91d1b41ce40cb9b080dcc2c_22241_321a6cc2798bcd5e6d9aade6c5b6a52f.png 400w,
               /image-20200128171213697_hu22ffba04a91d1b41ce40cb9b080dcc2c_22241_f181042f5859e34c0ebfc4662db09e93.png 760w,
               /image-20200128171213697_hu22ffba04a91d1b41ce40cb9b080dcc2c_22241_1200x1200_fit_lanczos_3.png 1200w&#34;
               src=&#34;/image-20200128171213697_hu22ffba04a91d1b41ce40cb9b080dcc2c_22241_321a6cc2798bcd5e6d9aade6c5b6a52f.png&#34;
               width=&#34;707&#34;
               height=&#34;239&#34;
               loading=&#34;lazy&#34; data-zoomable /&gt;&lt;/div&gt;
  &lt;/div&gt;&lt;/figure&gt;
&lt;/p&gt;
&lt;p&gt;必要に応じて&lt;/p&gt;
&lt;p&gt;















&lt;figure  &gt;
  &lt;div class=&#34;d-flex justify-content-center&#34;&gt;
    &lt;div class=&#34;w-100&#34; &gt;&lt;img alt=&#34;image-20200128163425236&#34; srcset=&#34;
               /image-20200128163425236_hu847111c897e5f1b4e77c75ba5b187720_26318_11ab2806d97c69fa7f32f708e721c01c.png 400w,
               /image-20200128163425236_hu847111c897e5f1b4e77c75ba5b187720_26318_0e8aca978d7e2befe8dc1022dbb87e59.png 760w,
               /image-20200128163425236_hu847111c897e5f1b4e77c75ba5b187720_26318_1200x1200_fit_lanczos_3.png 1200w&#34;
               src=&#34;/image-20200128163425236_hu847111c897e5f1b4e77c75ba5b187720_26318_11ab2806d97c69fa7f32f708e721c01c.png&#34;
               width=&#34;760&#34;
               height=&#34;338&#34;
               loading=&#34;lazy&#34; data-zoomable /&gt;&lt;/div&gt;
  &lt;/div&gt;&lt;/figure&gt;
&lt;/p&gt;
&lt;p&gt;ロール名は「NeptuneLoadFromS3」とした。&lt;/p&gt;
&lt;p&gt;















&lt;figure  &gt;
  &lt;div class=&#34;d-flex justify-content-center&#34;&gt;
    &lt;div class=&#34;w-100&#34; &gt;&lt;img alt=&#34;image-20200128163502048&#34; srcset=&#34;
               /image-20200128163502048_hu114ae8c790b22c989724ba0d60501347_37580_2f7f02226fea6d5a32263bc7728d52db.png 400w,
               /image-20200128163502048_hu114ae8c790b22c989724ba0d60501347_37580_956860757864d362cda82065cc920f5d.png 760w,
               /image-20200128163502048_hu114ae8c790b22c989724ba0d60501347_37580_1200x1200_fit_lanczos_3.png 1200w&#34;
               src=&#34;/image-20200128163502048_hu114ae8c790b22c989724ba0d60501347_37580_2f7f02226fea6d5a32263bc7728d52db.png&#34;
               width=&#34;760&#34;
               height=&#34;413&#34;
               loading=&#34;lazy&#34; data-zoomable /&gt;&lt;/div&gt;
  &lt;/div&gt;&lt;/figure&gt;
&lt;/p&gt;
&lt;p&gt;作成したロールの画面に移動する。&lt;/p&gt;
&lt;p&gt;















&lt;figure  &gt;
  &lt;div class=&#34;d-flex justify-content-center&#34;&gt;
    &lt;div class=&#34;w-100&#34; &gt;&lt;img alt=&#34;image-20200128163556778&#34; srcset=&#34;
               /image-20200128163556778_hu753ee5d435f7adbd2894e771b42b07c8_15172_ebcd2293b73e0aaaa8cb903e0b6e4790.png 400w,
               /image-20200128163556778_hu753ee5d435f7adbd2894e771b42b07c8_15172_113043440757e48cb6801d8b98ed3062.png 760w,
               /image-20200128163556778_hu753ee5d435f7adbd2894e771b42b07c8_15172_1200x1200_fit_lanczos_3.png 1200w&#34;
               src=&#34;/image-20200128163556778_hu753ee5d435f7adbd2894e771b42b07c8_15172_ebcd2293b73e0aaaa8cb903e0b6e4790.png&#34;
               width=&#34;760&#34;
               height=&#34;95&#34;
               loading=&#34;lazy&#34; data-zoomable /&gt;&lt;/div&gt;
  &lt;/div&gt;&lt;/figure&gt;
&lt;/p&gt;
&lt;p&gt;「信頼関係」-「信頼関係の編集」へと移動して下記を上書きして貼り付ける。&lt;/p&gt;
&lt;p&gt;















&lt;figure  &gt;
  &lt;div class=&#34;d-flex justify-content-center&#34;&gt;
    &lt;div class=&#34;w-100&#34; &gt;&lt;img alt=&#34;image-20200128163702608&#34; srcset=&#34;
               /image-20200128163702608_hu83331442523a35f8a1e568e72aa2cb2b_22192_f7958c2d86525eb165ad305327c9ce46.png 400w,
               /image-20200128163702608_hu83331442523a35f8a1e568e72aa2cb2b_22192_77eec835187a209e72a88764804f4716.png 760w,
               /image-20200128163702608_hu83331442523a35f8a1e568e72aa2cb2b_22192_1200x1200_fit_lanczos_3.png 1200w&#34;
               src=&#34;/image-20200128163702608_hu83331442523a35f8a1e568e72aa2cb2b_22192_f7958c2d86525eb165ad305327c9ce46.png&#34;
               width=&#34;711&#34;
               height=&#34;253&#34;
               loading=&#34;lazy&#34; data-zoomable /&gt;&lt;/div&gt;
  &lt;/div&gt;&lt;/figure&gt;
&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-json&#34;&gt;{
  &amp;quot;Version&amp;quot;: &amp;quot;2012-10-17&amp;quot;,
  &amp;quot;Statement&amp;quot;: [
    {
      &amp;quot;Sid&amp;quot;: &amp;quot;&amp;quot;,
      &amp;quot;Effect&amp;quot;: &amp;quot;Allow&amp;quot;,
      &amp;quot;Principal&amp;quot;: {
        &amp;quot;Service&amp;quot;: [
          &amp;quot;rds.amazonaws.com&amp;quot;
        ]
      },
      &amp;quot;Action&amp;quot;: &amp;quot;sts:AssumeRole&amp;quot;
    }
  ]
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;















&lt;figure  &gt;
  &lt;div class=&#34;d-flex justify-content-center&#34;&gt;
    &lt;div class=&#34;w-100&#34; &gt;&lt;img alt=&#34;image-20200128163744771&#34; srcset=&#34;
               /image-20200128163744771_hubbaaccb2a02fa1a7ca5e4032e6e2e3e8_21554_a62310fbfe886adcc290a92750a6454f.png 400w,
               /image-20200128163744771_hubbaaccb2a02fa1a7ca5e4032e6e2e3e8_21554_e39a6b96878ab17d5499f3784ba782bc.png 760w,
               /image-20200128163744771_hubbaaccb2a02fa1a7ca5e4032e6e2e3e8_21554_1200x1200_fit_lanczos_3.png 1200w&#34;
               src=&#34;/image-20200128163744771_hubbaaccb2a02fa1a7ca5e4032e6e2e3e8_21554_a62310fbfe886adcc290a92750a6454f.png&#34;
               width=&#34;594&#34;
               height=&#34;356&#34;
               loading=&#34;lazy&#34; data-zoomable /&gt;&lt;/div&gt;
  &lt;/div&gt;&lt;/figure&gt;
&lt;/p&gt;
&lt;h3 id=&#34;amazon-neptune-クラスターに-iam-ロールを追加する&#34;&gt;「Amazon Neptune クラスターに IAM ロール」を追加する&lt;/h3&gt;
&lt;p&gt;Neptuneのクラスタに移動して「IAMロールの管理」を選択。&lt;/p&gt;
&lt;p&gt;















&lt;figure  &gt;
  &lt;div class=&#34;d-flex justify-content-center&#34;&gt;
    &lt;div class=&#34;w-100&#34; &gt;&lt;img alt=&#34;image-20200128163850955&#34; srcset=&#34;
               /image-20200128163850955_hu3168e8a88362a2168aded68bbe6003a5_26737_23a7dfd5de7ef710224e9a009933b865.png 400w,
               /image-20200128163850955_hu3168e8a88362a2168aded68bbe6003a5_26737_26ca94b887f28bb6df857079072ab102.png 760w,
               /image-20200128163850955_hu3168e8a88362a2168aded68bbe6003a5_26737_1200x1200_fit_lanczos_3.png 1200w&#34;
               src=&#34;/image-20200128163850955_hu3168e8a88362a2168aded68bbe6003a5_26737_23a7dfd5de7ef710224e9a009933b865.png&#34;
               width=&#34;760&#34;
               height=&#34;89&#34;
               loading=&#34;lazy&#34; data-zoomable /&gt;&lt;/div&gt;
  &lt;/div&gt;&lt;/figure&gt;
&lt;/p&gt;
&lt;p&gt;先程作成したIAMロール(&lt;code&gt;NeptuneLoadFromS3&lt;/code&gt;)を追加する。&lt;/p&gt;
&lt;p&gt;















&lt;figure  &gt;
  &lt;div class=&#34;d-flex justify-content-center&#34;&gt;
    &lt;div class=&#34;w-100&#34; &gt;&lt;img alt=&#34;image-20200128163932718&#34; srcset=&#34;
               /image-20200128163932718_hu71d36bc3e37ecf519828698ec9b4d9a0_22315_f6fc4b58f701caf5c4420e56acfc3dcb.png 400w,
               /image-20200128163932718_hu71d36bc3e37ecf519828698ec9b4d9a0_22315_d1af462d2d77dcda3ea26009c70cb666.png 760w,
               /image-20200128163932718_hu71d36bc3e37ecf519828698ec9b4d9a0_22315_1200x1200_fit_lanczos_3.png 1200w&#34;
               src=&#34;/image-20200128163932718_hu71d36bc3e37ecf519828698ec9b4d9a0_22315_f6fc4b58f701caf5c4420e56acfc3dcb.png&#34;
               width=&#34;677&#34;
               height=&#34;403&#34;
               loading=&#34;lazy&#34; data-zoomable /&gt;&lt;/div&gt;
  &lt;/div&gt;&lt;/figure&gt;
&lt;/p&gt;
&lt;h3 id=&#34;s3-vpcエンドポイントを作成&#34;&gt;S3 VPCエンドポイントを作成&lt;/h3&gt;
&lt;p&gt;S3からNeptuneにロードする際にVPCエンドポイントが必要なのでVPCエンドポイントを設定する。&lt;/p&gt;
&lt;p&gt;エンドポイントの作成画面で「com.amazonaws.ap-northeast-1.s3」を選択する。（今回はTokyoリージョンなので&lt;code&gt;ap-northeast-1&lt;/code&gt;だが、他リージョンの場合はリージョン名が異なる。）&lt;/p&gt;
&lt;p&gt;















&lt;figure  &gt;
  &lt;div class=&#34;d-flex justify-content-center&#34;&gt;
    &lt;div class=&#34;w-100&#34; &gt;&lt;img alt=&#34;image-20200128164302433&#34; srcset=&#34;
               /image-20200128164302433_hu4065708f9c6027b6f82d201385a4963f_77761_974a93ac1fc0eceecc54d54ac0ee14df.png 400w,
               /image-20200128164302433_hu4065708f9c6027b6f82d201385a4963f_77761_d86a87d3a5591147676b94e08acb81d3.png 760w,
               /image-20200128164302433_hu4065708f9c6027b6f82d201385a4963f_77761_1200x1200_fit_lanczos_3.png 1200w&#34;
               src=&#34;/image-20200128164302433_hu4065708f9c6027b6f82d201385a4963f_77761_974a93ac1fc0eceecc54d54ac0ee14df.png&#34;
               width=&#34;760&#34;
               height=&#34;510&#34;
               loading=&#34;lazy&#34; data-zoomable /&gt;&lt;/div&gt;
  &lt;/div&gt;&lt;/figure&gt;
&lt;/p&gt;
&lt;p&gt;VPCやルートテーブルを指定する&lt;/p&gt;
&lt;p&gt;















&lt;figure  &gt;
  &lt;div class=&#34;d-flex justify-content-center&#34;&gt;
    &lt;div class=&#34;w-100&#34; &gt;&lt;img alt=&#34;image-20200128164436298&#34; srcset=&#34;
               /image-20200128164436298_hu00a71f8427d3e852cc84b408ad589819_75413_5ad124e1ba4871b03622d984ef6ebadf.png 400w,
               /image-20200128164436298_hu00a71f8427d3e852cc84b408ad589819_75413_7a5e5f13374a17a70d89ed0f7d04dc92.png 760w,
               /image-20200128164436298_hu00a71f8427d3e852cc84b408ad589819_75413_1200x1200_fit_lanczos_3.png 1200w&#34;
               src=&#34;/image-20200128164436298_hu00a71f8427d3e852cc84b408ad589819_75413_5ad124e1ba4871b03622d984ef6ebadf.png&#34;
               width=&#34;760&#34;
               height=&#34;661&#34;
               loading=&#34;lazy&#34; data-zoomable /&gt;&lt;/div&gt;
  &lt;/div&gt;&lt;/figure&gt;
&lt;/p&gt;
&lt;h3 id=&#34;s3からneptuneへのデータのロード&#34;&gt;S3からNeptuneへのデータのロード&lt;/h3&gt;
&lt;p&gt;ここまででS3からNeptuneへロードする準備が出来た。ロードするデータは &lt;a href=&#34;http://rdf.geospecies.org&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;http://rdf.geospecies.org&lt;/a&gt; のデータを使用することにする。rdfxml形式のRDFデータのサンプルをS3の所定のバケットにアップロード&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;[ec2-user@bastin nep-tool]$ curl -O http://rdf.geospecies.org/geospecies.rdf.gz
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100 8891k  100 8891k    0     0  3405k      0  0:00:02  0:00:02 --:--:-- 3404k
[ec2-user@bastin nep-tool]$ 
[ec2-user@bastin nep-tool]$ ls -l geospecies.rdf.gz
-rw-rw-r-- 1 ec2-user ec2-user 9105109 Jan 28 08:16 geospecies.rdf.gz
[ec2-user@bastin nep-tool]$ aws s3 cp geospecies.rdf.gz s3://nep-s3-xxxx/
upload: ./geospecies.rdf.gz to s3://nep-s3-xxxx/geospecies.rdf.gz 
[ec2-user@bastin nep-tool]$   
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;下記コマンドでデータをロードする。&lt;code&gt;エンドポイント&lt;/code&gt;、&lt;code&gt;source&lt;/code&gt;、&lt;code&gt;format&lt;/code&gt;、&lt;code&gt;iamRoleArn&lt;/code&gt;を必要に応じて変更が必要。&lt;/p&gt;
&lt;p&gt;RDFの場合のformatは他にも&lt;code&gt;turtle&lt;/code&gt;や&lt;code&gt;ntriples&lt;/code&gt;なども選択可能。&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;ロードデータ形式 - Amazon Neptune &lt;a href=&#34;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/bulk-load-tutorial-format.html&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/bulk-load-tutorial-format.html&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;curl -X POST \
    -H &#39;Content-Type: application/json&#39; \
    https://neptest.xxxxxxxxxxxx.ap-northeast-1.neptune.amazonaws.com:8182/loader -d &#39;
    {
      &amp;quot;source&amp;quot; : &amp;quot;s3://nep-s3-xxxx/geospecies.rdf.gz&amp;quot;, 
      &amp;quot;format&amp;quot; : &amp;quot;rdfxml&amp;quot;,
      &amp;quot;iamRoleArn&amp;quot; : &amp;quot;arn:aws:iam::xxxxxxxxx:role/NeptuneLoadFromS3&amp;quot;,
      &amp;quot;region&amp;quot; : &amp;quot;ap-northeast-1&amp;quot;,
      &amp;quot;failOnError&amp;quot; : &amp;quot;FALSE&amp;quot;,
      &amp;quot;parallelism&amp;quot; : &amp;quot;HIGH&amp;quot;
    }&#39;
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;実行後、下記が表示される。状況確認に&lt;code&gt;loadId&lt;/code&gt;が必要なので控えておく。&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;{
    &amp;quot;status&amp;quot; : &amp;quot;200 OK&amp;quot;,
    &amp;quot;payload&amp;quot; : {
        &amp;quot;loadId&amp;quot; : &amp;quot;eff1268f-17ab-473a-b845-c2d91a317c01&amp;quot;
    }

&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;データロードのステータス確認。先程取得した&lt;code&gt;loadId&lt;/code&gt;を指定する&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;curl -G &#39;https://neptest.xxxxxxxxxxxx.ap-northeast-1.neptune.amazonaws.com:8182/loader/eff1268f-17ab-473a-b845-c2d91a317c01&#39;
&lt;/code&gt;&lt;/pre&gt;
&lt;h5 id=&#34;進行中の出力&#34;&gt;進行中の出力&lt;/h5&gt;
&lt;pre&gt;&lt;code class=&#34;language-json&#34;&gt;[ec2-user@bastin nep-tool]$ curl -G &#39;https://neptest.xxxxxxxxxxxx.ap-northeast-1.neptune.amazonaws.com:8182/loader/eff1268f-17ab-473a-b845-c2d91a317c01&#39;
{
    &amp;quot;status&amp;quot; : &amp;quot;200 OK&amp;quot;,
    &amp;quot;payload&amp;quot; : {
        &amp;quot;feedCount&amp;quot; : [
            {
                &amp;quot;LOAD_IN_PROGRESS&amp;quot; : 1
            }
        ],
        &amp;quot;overallStatus&amp;quot; : {
            &amp;quot;fullUri&amp;quot; : &amp;quot;s3://nep-s3-xxxx/geospecies.rdf.gz&amp;quot;,
            &amp;quot;runNumber&amp;quot; : 1,
            &amp;quot;retryNumber&amp;quot; : 0,
            &amp;quot;status&amp;quot; : &amp;quot;LOAD_IN_PROGRESS&amp;quot;,
            &amp;quot;totalTimeSpent&amp;quot; : 148,
            &amp;quot;startTime&amp;quot; : 1580199498,
            &amp;quot;totalRecords&amp;quot; : 2130000,
            &amp;quot;totalDuplicates&amp;quot; : 0,
            &amp;quot;parsingErrors&amp;quot; : 0,
            &amp;quot;datatypeMismatchErrors&amp;quot; : 0,
            &amp;quot;insertErrors&amp;quot; : 0
        }
    }
}
&lt;/code&gt;&lt;/pre&gt;
&lt;h5 id=&#34;ロード完了の出力&#34;&gt;ロード完了の出力&lt;/h5&gt;
&lt;pre&gt;&lt;code class=&#34;language-json&#34;&gt;[ec2-user@bastin nep-tool]$ curl -G &#39;https://neptest.xxxxxxxxxxxx.ap-northeast-1.neptune.amazonaws.com:8182/loader/eff1268f-17ab-473a-b845-c2d91a317c01&#39;
{
    &amp;quot;status&amp;quot; : &amp;quot;200 OK&amp;quot;,
    &amp;quot;payload&amp;quot; : {
        &amp;quot;feedCount&amp;quot; : [
            {
                &amp;quot;LOAD_COMPLETED&amp;quot; : 1
            }
        ],
        &amp;quot;overallStatus&amp;quot; : {
            &amp;quot;fullUri&amp;quot; : &amp;quot;s3://nep-s3-xxxx/geospecies.rdf.gz&amp;quot;,
            &amp;quot;runNumber&amp;quot; : 1,
            &amp;quot;retryNumber&amp;quot; : 0,
            &amp;quot;status&amp;quot; : &amp;quot;LOAD_COMPLETED&amp;quot;,
            &amp;quot;totalTimeSpent&amp;quot; : 149,
            &amp;quot;startTime&amp;quot; : 1580199498,
            &amp;quot;totalRecords&amp;quot; : 2201532,
            &amp;quot;totalDuplicates&amp;quot; : 0,
            &amp;quot;parsingErrors&amp;quot; : 0,
            &amp;quot;datatypeMismatchErrors&amp;quot; : 0,
            &amp;quot;insertErrors&amp;quot; : 0
        }
    }
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;各フィールドの説明は下記の通り。今回の例では「&lt;strong&gt;&lt;u&gt;2,201,532&lt;/u&gt;&lt;/strong&gt;」行のロードに「&lt;strong&gt;&lt;u&gt;149&lt;/u&gt;&lt;/strong&gt;」秒掛かっていることがわかる。&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Neptune Loader Get-Status API - Amazon Neptune &lt;a href=&#34;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/load-api-reference-status.html&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/load-api-reference-status.html&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;table&gt;
&lt;thead&gt;
&lt;tr&gt;
&lt;th&gt;フィールド&lt;/th&gt;
&lt;th&gt;説明&lt;/th&gt;
&lt;/tr&gt;
&lt;/thead&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;fullUri&lt;/td&gt;
&lt;td&gt;ロードされる 1 つ以上のファイルの URI。形式: s3://bucket/key&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;runNumber&lt;/td&gt;
&lt;td&gt;このロードまたはフィードの実行数。これは、ロードが再開されると増加します。&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;retryNumber&lt;/td&gt;
&lt;td&gt;このロードまたはフィードの再試行回数。これは、ローダーがフィードまたはロードを自動的に再試行するときに増加されます。&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;status&lt;/td&gt;
&lt;td&gt;ロードあるいはフィードの返されたステータス。LOAD_COMPLETED はロードが問題なく成功したことを示します。&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;totalTimeSpent&lt;/td&gt;
&lt;td&gt;ロードまたはフィードのデータの解析や挿入に費やした時間 (秒単位)。これには、ソースファイルのリストを取得するのに費やされた時間は含まれません。&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;totalRecords&lt;/td&gt;
&lt;td&gt;ロードされた、またはロードしようとした全レコード。&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;totalDuplicates&lt;/td&gt;
&lt;td&gt;発生した重複レコードの数。&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;parsingErrors&lt;/td&gt;
&lt;td&gt;発生した解析エラーの数。&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;datatypeMismatchErrors&lt;/td&gt;
&lt;td&gt;指定されたデータとデータ型が一致しないレコードの数。&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;insertErrors&lt;/td&gt;
&lt;td&gt;エラーのために挿入できなかったレコードの数。&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;h3 id=&#34;neptuneへのクエリ発行&#34;&gt;Neptuneへのクエリ発行&lt;/h3&gt;
&lt;p&gt;データロードまで出来たのでクエリを発行する。&lt;/p&gt;
&lt;h4 id=&#34;http-rest-エンドポイントを使用する場合&#34;&gt;HTTP REST エンドポイントを使用する場合&lt;/h4&gt;
&lt;blockquote&gt;
&lt;p&gt;HTTP REST エンドポイントを使用して Neptune DB インスタンスに接続する - Amazon Neptune &lt;a href=&#34;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/access-graph-sparql-http-rest.html&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/access-graph-sparql-http-rest.html&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;curl -X POST --data-binary &#39;query=select ?s ?p ?o where {?s ?p ?o} limit 10&#39; https://neptest.xxxxxxxxxxxx.ap-northeast-1.neptune.amazonaws.com:8182/sparql
&lt;/code&gt;&lt;/pre&gt;
&lt;h5 id=&#34;実行結果&#34;&gt;実行結果&lt;/h5&gt;
&lt;pre&gt;&lt;code class=&#34;language-json&#34;&gt;[ec2-user@bastin nep-tool]$ curl -X POST --data-binary &#39;query=select ?s ?p ?o where {?s ?p ?o} limit 10&#39; https://neptest.xxxxxxxxxxxx.ap-northeast-1.neptune.amazonaws.com:8182/sparql
{
  &amp;quot;head&amp;quot; : {
    &amp;quot;vars&amp;quot; : [ &amp;quot;s&amp;quot;, &amp;quot;p&amp;quot;, &amp;quot;o&amp;quot; ]
  },
  &amp;quot;results&amp;quot; : {
    &amp;quot;bindings&amp;quot; : [ {
      &amp;quot;s&amp;quot; : {
        &amp;quot;type&amp;quot; : &amp;quot;uri&amp;quot;,
        &amp;quot;value&amp;quot; : &amp;quot;http://lod.geospecies.org/ses/uRtpv&amp;quot;
      },
      &amp;quot;p&amp;quot; : {
        &amp;quot;type&amp;quot; : &amp;quot;uri&amp;quot;,
        &amp;quot;value&amp;quot; : &amp;quot;http://rdf.geospecies.org/ont/geospecies#isUnexpectedIn&amp;quot;
      },
      &amp;quot;o&amp;quot; : {
        &amp;quot;type&amp;quot; : &amp;quot;uri&amp;quot;,
        &amp;quot;value&amp;quot; : &amp;quot;http://sws.geonames.org/5001836/&amp;quot;
      }
～省略～
&lt;/code&gt;&lt;/pre&gt;
&lt;h4 id=&#34;rdf4j-コンソールを使用する場合&#34;&gt;RDF4J コンソールを使用する場合&lt;/h4&gt;
&lt;blockquote&gt;
&lt;p&gt;RDF4J コンソールを使用して Neptune DB インスタンスに接続する - Amazon Neptune &lt;a href=&#34;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/access-graph-sparql-rdf4j-console.html&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/access-graph-sparql-rdf4j-console.html&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;a href=&#34;https://rdf4j.org/download/&#34; target=&#34;_blank&#34; rel=&#34;noopener&#34;&gt;RDF4J のサイト&lt;/a&gt;からRDF4J SDKをダウンロード&lt;/p&gt;
&lt;p&gt;















&lt;figure  &gt;
  &lt;div class=&#34;d-flex justify-content-center&#34;&gt;
    &lt;div class=&#34;w-100&#34; &gt;&lt;img alt=&#34;image-20200128173450786&#34; srcset=&#34;
               /image-20200128173450786_hufb1c7b4740c54e5b27b3d90848329568_40001_c81ec32363c43c07d8e87243f69b7d67.png 400w,
               /image-20200128173450786_hufb1c7b4740c54e5b27b3d90848329568_40001_46aaf28f45dc0bb07f9daa64cd335619.png 760w,
               /image-20200128173450786_hufb1c7b4740c54e5b27b3d90848329568_40001_1200x1200_fit_lanczos_3.png 1200w&#34;
               src=&#34;/image-20200128173450786_hufb1c7b4740c54e5b27b3d90848329568_40001_c81ec32363c43c07d8e87243f69b7d67.png&#34;
               width=&#34;760&#34;
               height=&#34;210&#34;
               loading=&#34;lazy&#34; data-zoomable /&gt;&lt;/div&gt;
  &lt;/div&gt;&lt;/figure&gt;
&lt;/p&gt;
&lt;p&gt;特定のEC2にダウンロードしたzipファイルをアップロードする。&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;[ec2-user@bastin nep-tool]$ ls -l
total 104740
-rw-r--r-- 1 ec2-user ec2-user 98147430 Jan 25 06:16 eclipse-rdf4j-3.0.4-sdk.zip
-rw-rw-r-- 1 ec2-user ec2-user  9105109 Jan 28 08:16 geospecies.rdf.gz
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;zipファイルをunzip後に、bin配下に存在する &lt;code&gt;console.sh&lt;/code&gt;を実行する&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;[ec2-user@bastin nep-tool]$ ./eclipse-rdf4j-3.0.4/bin/console.sh
08:37:35.639 [main] DEBUG org.eclipse.rdf4j.common.platform.PlatformFactory - os.name = linux
08:37:35.652 [main] DEBUG org.eclipse.rdf4j.common.platform.PlatformFactory - Detected Posix platform
Connected to default data directory
RDF4J Console 3.0.4+47737c0

3.0.4+47737c0
Type &#39;help&#39; for help.
&amp;gt; 
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;Neptune DB インスタンス に SPARQL リポジトリを作成。&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;create sparql
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;下記情報の入力を求められるので入力する。未確認だがリードレプリカを作った場合はここの「SPARQL クエリのエンドポイント」と「SPARQL 更新エンドポイント」をマスタとリードレプリカに分けるべきなのではないかと推測。&lt;/p&gt;
&lt;table&gt;
&lt;thead&gt;
&lt;tr&gt;
&lt;th&gt;変数名&lt;/th&gt;
&lt;th&gt;値&lt;/th&gt;
&lt;/tr&gt;
&lt;/thead&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;SPARQL クエリのエンドポイント&lt;/td&gt;
&lt;td&gt;https://your-neptune-endpoint:port/sparql&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;SPARQL 更新エンドポイント&lt;/td&gt;
&lt;td&gt;https://your-neptune-endpoint:port/sparql&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;ローカルリポジトリ ID [endpoint@localhost]&lt;/td&gt;
&lt;td&gt;neptune&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;リポジトリタイトル [SPARQL エンドポイントリポジトリ  @localhost]&lt;/td&gt;
&lt;td&gt;Neptune  DB instance&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;&amp;gt; create sparql
Please specify values for the following variables:
SPARQL query endpoint: https://neptest.xxxxxxxxxxxx.ap-northeast-1.neptune.amazonaws.com:8182/sparql
SPARQL update endpoint: https://neptest.xxxxxxxxxxxx.ap-northeast-1.neptune.amazonaws.com:8182/sparql
Local repository ID [endpoint@localhost]: neptune
Repository title [SPARQL endpoint repository @localhost]: neptune

Repository created
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;Neptune インスタンスに接続する。接続後はプロンプトにローカルリポジトリ IDが表示される。&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;&amp;gt; open neptune
Opened repository &#39;neptune&#39;
neptune&amp;gt; 
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;HTTP REST エンドポイントを使用して実行した場合と同様のクエリを実行してみる。&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;neptune&amp;gt; sparql select ?s ?p ?o where {?s ?p ?o} limit 10
Evaluating SPARQL query...
+------------------------+------------------------+------------------------+
| s                      | p                      | o                      |
+------------------------+------------------------+------------------------+
| &amp;lt;http://lod.geospecies.org/ses/zJIK4&amp;gt;| &amp;lt;http://rdf.geospecies.org/ont/geospecies#hasScientificNameAuthorship&amp;gt;| &amp;quot;(LeConte, 1866)&amp;quot;^^xsd:string|
| &amp;lt;http://lod.geospecies.org/ses/zJIK4&amp;gt;| &amp;lt;http://rdf.geospecies.org/ont/geospecies#hasScientificName&amp;gt;| &amp;quot;Iphthiminus opacus (LeConte, 1866)&amp;quot;^^xsd:string|
| &amp;lt;http://lod.geospecies.org/ses/zJIK4&amp;gt;| &amp;lt;http://rdf.geospecies.org/ont/geospecies#isExpectedIn&amp;gt;| &amp;lt;http://sws.geonames.org/6255149/&amp;gt;|
| &amp;lt;http://lod.geospecies.org/ses/zJIK4&amp;gt;| &amp;lt;http://rdf.geospecies.org/ont/geospecies#isExpectedIn&amp;gt;| &amp;lt;http://sws.geonames.org/5279468/&amp;gt;|
| &amp;lt;http://lod.geospecies.org/ses/zJIK4&amp;gt;| &amp;lt;http://rdf.geospecies.org/ont/geospecies#hasNomenclaturalCode&amp;gt;| &amp;lt;http://rdf.geospecies.org/ont/geospecies#NomenclaturalCode_ICZN&amp;gt;|
| &amp;lt;http://lod.geospecies.org/ses/zJIK4&amp;gt;| &amp;lt;http://rdf.geospecies.org/ont/geospecies#isUnknownAboutIn&amp;gt;| &amp;lt;http://sws.geonames.org/4862182/&amp;gt;|
| &amp;lt;http://lod.geospecies.org/ses/zJIK4&amp;gt;| &amp;lt;http://rdf.geospecies.org/ont/geospecies#isUnknownAboutIn&amp;gt;| &amp;lt;http://sws.geonames.org/5037779/&amp;gt;|
| &amp;lt;http://lod.geospecies.org/ses/zJIK4&amp;gt;| &amp;lt;http://rdf.geospecies.org/ont/geospecies#isUnknownAboutIn&amp;gt;| &amp;lt;http://sws.geonames.org/5001836/&amp;gt;|
| &amp;lt;http://lod.geospecies.org/ses/zJIK4&amp;gt;| &amp;lt;http://rdf.geospecies.org/ont/geospecies#isUnknownAboutIn&amp;gt;| &amp;lt;http://sws.geonames.org/2635167/&amp;gt;|
| &amp;lt;http://lod.geospecies.org/ses/zJIK4&amp;gt;| &amp;lt;http://rdf.geospecies.org/ont/geospecies#hasSubfamilyName&amp;gt;| &amp;quot;Coelometopinae&amp;quot;^^xsd:string|
+------------------------+------------------------+------------------------+
10 result(s) (1268 ms)
neptune&amp;gt; 

&lt;/code&gt;&lt;/pre&gt;
</description>
    </item>
    
  </channel>
</rss>
