<?xml version="1.0" encoding="utf-8" standalone="yes" ?>
<rss version="2.0" xmlns:atom="http://www.w3.org/2005/Atom">
  <channel>
    <title>Neptune | my opinion is my own</title>
    <link>/tags/neptune/</link>
      <atom:link href="/tags/neptune/index.xml" rel="self" type="application/rss+xml" />
    <description>Neptune</description>
    <generator>Source Themes Academic (https://sourcethemes.com/academic/)</generator><language>ja</language><lastBuildDate>Tue, 10 Mar 2020 00:00:00 +0000</lastBuildDate>
    <image>
      <url>img/icon-192.png</url>
      <title>Neptune</title>
      <link>/tags/neptune/</link>
    </image>
    
    <item>
      <title>LODデータの作成方法の参考リンク</title>
      <link>/loddata-how-to-create-link.html</link>
      <pubDate>Tue, 10 Mar 2020 00:00:00 +0000</pubDate>
      <guid>/loddata-how-to-create-link.html</guid>
      <description>&lt;p&gt;Linked Open Data（リンクト・オープン・データ、略名: LOD）の公開方法についてまとめているリンク集。ExcelデータやRDBMSに格納されている構造データ、CSVデータをどのようにLOD化するのかイメージ付いていなかったが、これを見ればなんとなく出来る感じがする。&lt;/p&gt;
&lt;iframe src=&#34;//www.slideshare.net/slideshow/embed_code/key/5LXJyTnPsifaaZ&#34; width=&#34;595&#34; height=&#34;485&#34; frameborder=&#34;0&#34; marginwidth=&#34;0&#34; marginheight=&#34;0&#34; scrolling=&#34;no&#34; style=&#34;border:1px solid #CCC; border-width:1px; margin-bottom:5px; max-width: 100%;&#34; allowfullscreen&gt; &lt;/iframe&gt; &lt;div style=&#34;margin-bottom:5px&#34;&gt; &lt;strong&gt; &lt;a href=&#34;//www.slideshare.net/fuyukoitomatsumura/lod5lod&#34; title=&#34;LOD連続講義 第5回「LODの作り方・使い方」&#34; target=&#34;_blank&#34;&gt;LOD連続講義 第5回「LODの作り方・使い方」&lt;/a&gt; &lt;/strong&gt; from &lt;strong&gt;&lt;a href=&#34;https://www.slideshare.net/fuyukoitomatsumura&#34; target=&#34;_blank&#34;&gt;Fuyuko Matsumura&lt;/a&gt;&lt;/strong&gt; &lt;/div&gt;
&lt;iframe src=&#34;//www.slideshare.net/slideshow/embed_code/key/3Dosyw4nsFRLB8&#34; width=&#34;595&#34; height=&#34;485&#34; frameborder=&#34;0&#34; marginwidth=&#34;0&#34; marginheight=&#34;0&#34; scrolling=&#34;no&#34; style=&#34;border:1px solid #CCC; border-width:1px; margin-bottom:5px; max-width: 100%;&#34; allowfullscreen&gt; &lt;/iframe&gt; &lt;div style=&#34;margin-bottom:5px&#34;&gt; &lt;strong&gt; &lt;a href=&#34;//www.slideshare.net/KoujiKozaki/20140823kozaki-v2&#34; title=&#34;LOD技術の概要と LinkData.orgを用いたLOD公開&#34; target=&#34;_blank&#34;&gt;LOD技術の概要と LinkData.orgを用いたLOD公開&lt;/a&gt; &lt;/strong&gt; from &lt;strong&gt;&lt;a href=&#34;https://www.slideshare.net/KoujiKozaki&#34; target=&#34;_blank&#34;&gt;Kouji Kozaki&lt;/a&gt;&lt;/strong&gt; &lt;/div&gt;
&lt;iframe src=&#34;//www.slideshare.net/slideshow/embed_code/key/hu8jC7ymKp4hrm&#34; width=&#34;595&#34; height=&#34;485&#34; frameborder=&#34;0&#34; marginwidth=&#34;0&#34; marginheight=&#34;0&#34; scrolling=&#34;no&#34; style=&#34;border:1px solid #CCC; border-width:1px; margin-bottom:5px; max-width: 100%;&#34; allowfullscreen&gt; &lt;/iframe&gt; &lt;div style=&#34;margin-bottom:5px&#34;&gt; &lt;strong&gt; &lt;a href=&#34;//www.slideshare.net/KoujiKozaki/csvlod&#34; title=&#34;CSVファイルをLODとして公開するデータソン&#34; target=&#34;_blank&#34;&gt;CSVファイルをLODとして公開するデータソン&lt;/a&gt; &lt;/strong&gt; from &lt;strong&gt;&lt;a href=&#34;https://www.slideshare.net/KoujiKozaki&#34; target=&#34;_blank&#34;&gt;Kouji Kozaki&lt;/a&gt;&lt;/strong&gt; &lt;/div&gt;
&lt;iframe src=&#34;//www.slideshare.net/slideshow/embed_code/key/FVF9EJgwtCq4Dt&#34; width=&#34;595&#34; height=&#34;485&#34; frameborder=&#34;0&#34; marginwidth=&#34;0&#34; marginheight=&#34;0&#34; scrolling=&#34;no&#34; style=&#34;border:1px solid #CCC; border-width:1px; margin-bottom:5px; max-width: 100%;&#34; allowfullscreen&gt; &lt;/iframe&gt; &lt;div style=&#34;margin-bottom:5px&#34;&gt; &lt;strong&gt; &lt;a href=&#34;//www.slideshare.net/machimasuoka/ss-42456061&#34; title=&#34;LODオープンデータのつくりかたと項目名のつけかた&#34; target=&#34;_blank&#34;&gt;LODオープンデータのつくりかたと項目名のつけかた&lt;/a&gt; &lt;/strong&gt; from &lt;strong&gt;&lt;a href=&#34;https://www.slideshare.net/machimasuoka&#34; target=&#34;_blank&#34;&gt;machi takahashi&lt;/a&gt;&lt;/strong&gt; &lt;/div&gt;
</description>
    </item>
    
    <item>
      <title>SPARQLを使用して英語版DBpediaからディープインパクトの始祖を辿る</title>
      <link>/sparql-graph-dbpedia-en-search.html</link>
      <pubDate>Tue, 25 Feb 2020 00:00:00 +0000</pubDate>
      <guid>/sparql-graph-dbpedia-en-search.html</guid>
      <description>&lt;h3 id=&#34;heading&#34;&gt;はじめに&lt;/h3&gt;
&lt;p&gt;下記記事のリベンジ記事です。有馬記念の勝ち馬からサラブレッドの始祖まで辿ろうとしたが、dbpedia-jp(jp.wikipedia.org)のURI誤りで途中で終わってしまった。&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;日本語版DBPediaで有馬記念の勝ち馬からサラブレッドの始祖を辿る | my opinion is my own &lt;a href=&#34;https://zatoima.github.io/sparql-graph-thoroughbred-search.html&#34;&gt;https://zatoima.github.io/sparql-graph-thoroughbred-search.html&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;リベンジとして、英語版のDBPediaを使いディープインパクトを起点として始祖まで辿ろうと思います。&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;競馬で走る馬はサラブレッドと呼ばれますが、血統を辿ると全て3頭の馬(ダーレーアラビアン、ゴドルフィンアラビアン、バイアリーターク)にさかのぼると言います。&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;3大始祖と世界の血統：サラブレッド講座　JRA &lt;a href=&#34;http://www.jra.go.jp/kouza/thoroughbred/founder/&#34;&gt;http://www.jra.go.jp/kouza/thoroughbred/founder/&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/blockquote&gt;
&lt;h3 id=&#34;dbpedia&#34;&gt;DBpedia（英語版）&lt;/h3&gt;
&lt;blockquote&gt;
&lt;p&gt;Virtuoso SPARQL Query Editor &lt;a href=&#34;https://dbpedia.org/sparql&#34;&gt;https://dbpedia.org/sparql&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h3 id=&#34;sparql&#34;&gt;SPARQLクエリ&lt;/h3&gt;
&lt;p&gt;最終的にこうしました。&lt;/p&gt;
&lt;p&gt;述語部分はsireとなります。父という意味です。リーディングサイアー (Leading Sire)と言いますね。&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;PREFIX dbpedia: &amp;lt;http://dbpedia.org/ontology/&amp;gt;

select ?parent_gen1_name ?parent_gen2_name ?parent_gen3_name ?parent_gen4_name ?parent_gen5_name ?parent_gen6_name ?parent_gen7_name ?parent_gen8_name ?parent_gen9_name ?parent_gen10_name ?parent_gen11_name ?parent_gen12_name ?parent_gen13_name ?parent_gen14_name ?parent_gen15_name ?parent_gen16_name ?parent_gen17_name ?parent_gen18_name ?parent_gen19_name ?parent_gen20_name ?parent_gen21_name ?parent_gen22_name ?parent_gen23_name ?parent_gen24_name ?parent_gen25_name
where { 
  &amp;lt;http://dbpedia.org/resource/Deep_Impact_(horse)&amp;gt; dbpedia:sire ?parent_gen1_name . 
   ?parent_gen1_name dbpedia:sire ?parent_gen2_name . #Sunday_Silence
   ?parent_gen2_name dbpedia:sire ?parent_gen3_name . #Halo
   ?parent_gen3_name dbpedia:sire ?parent_gen4_name . #Hail_To_Reason
   ?parent_gen4_name dbpedia:sire ?parent_gen5_name . #Turn-To
   ?parent_gen5_name dbpedia:sire ?parent_gen6_name . #Royal_Charger
   ?parent_gen6_name dbpedia:sire ?parent_gen7_name . #Nearco
   ?parent_gen7_name dbpedia:sire ?parent_gen8_name . #Pharos
   ?parent_gen8_name dbpedia:sire ?parent_gen9_name . #Phalaris
   ?parent_gen9_name dbpedia:sire ?parent_gen10_name . #Polymelus
   ?parent_gen10_name dbpedia:sire ?parent_gen11_name . #Cyllene
   ?parent_gen11_name dbpedia:sire ?parent_gen12_name . #Bona_Vista
   ?parent_gen12_name dbpedia:sire ?parent_gen13_name . #Bend_Or
   ?parent_gen13_name dbpedia:sire ?parent_gen14_name . #Doncaster
   ?parent_gen14_name dbpedia:sire ?parent_gen15_name . #The_Baron
   ?parent_gen15_name dbpedia:sire ?parent_gen16_name . #Birdcatcher
   ?parent_gen16_name dbpedia:wikiPageRedirects ?Birdcatcher_wpr .
   ?Birdcatcher_wpr dbo:sire ?parent_gen17_name . #Sir_Hercules
   ?parent_gen17_name dbpedia:sire ?parent_gen18_name . #Whalebone
   ?parent_gen18_name dbpedia:sire ?parent_gen19_name . #Waxy
   ?parent_gen19_name dbpedia:sire ?parent_gen20_name . #Potoooooooo
   ?parent_gen20_name dbpedia:sire ?parent_gen21_name . #Eclipse
   ?parent_gen21_name dbpedia:sire ?parent_gen22_name . #Marske
   ?parent_gen22_name dbpedia:sire ?parent_gen23_name . #Squirt
   ?parent_gen23_name dbpedia:sire ?parent_gen24_name . #Bartlets_Childers
   ?parent_gen24_name dbpedia:wikiPageRedirects ?Bartlets_Childers .
   ?Bartlets_Childers dbo:sire ?parent_gen25_name . #Darley_Arabian
}

&lt;/code&gt;&lt;/pre&gt;
&lt;h3 id=&#34;heading-1&#34;&gt;補足&lt;/h3&gt;
&lt;p&gt;&lt;code&gt;Birdcatcher&lt;/code&gt;と&lt;code&gt;Bartlets_Childers&lt;/code&gt;には他の競走馬にある&lt;code&gt;http://dbpedia.org/ontology/sire&lt;/code&gt;プロパティがなく、そこからは親を辿れません。&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;PREFIX dbpedia: &amp;lt;http://dbpedia.org/ontology/&amp;gt;

select *
where { 
  &amp;lt;http://dbpedia.org/resource/Birdcatcher&amp;gt; ?p ?o .
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;image-20200222161400597.png&#34; alt=&#34;image-20200222161400597&#34;&gt;&lt;/p&gt;
&lt;p&gt;述語が&lt;code&gt;http://dbpedia.org/ontology/wikiPageRedirects&lt;/code&gt;の&lt;code&gt;http://dbpedia.org/resource/Birdcatcher_(horse)&lt;/code&gt;に行くと&lt;code&gt;dbo:sire&lt;/code&gt;がありましたのでこちらのPropertyを使用します。&lt;/p&gt;
&lt;p&gt;こうすることでsireを取得することが出来ました。&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;PREFIX dbpedia: &amp;lt;http://dbpedia.org/ontology/&amp;gt;

select ?Birdcatcher_sire
where { 
  &amp;lt;http://dbpedia.org/resource/Birdcatcher&amp;gt; dbpedia:wikiPageRedirects ?Birdcatcher_wpr .
  ?Birdcatcher_wpr dbo:sire ?Birdcatcher_sire
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;image-20200222165056244.png&#34; alt=&#34;image-20200222165056244&#34;&gt;&lt;/p&gt;
&lt;h3 id=&#34;heading-2&#34;&gt;結果&lt;/h3&gt;
&lt;p&gt;最終的な結果はこうなりました。ディープインパクトの始祖は&lt;a href=&#34;https://ja.wikipedia.org/wiki/%E3%83%80%E3%83%BC%E3%83%AC%E3%83%BC%E3%82%A2%E3%83%A9%E3%83%93%E3%82%A2%E3%83%B3&#34;&gt;Darley_Arabian&lt;/a&gt;となります！&lt;/p&gt;
&lt;table&gt;
&lt;thead&gt;
&lt;tr&gt;
&lt;th&gt;世代&lt;/th&gt;
&lt;th&gt;馬名&lt;/th&gt;
&lt;/tr&gt;
&lt;/thead&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;1&lt;/td&gt;
&lt;td&gt;Sunday_Silence&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;2&lt;/td&gt;
&lt;td&gt;Halo&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;3&lt;/td&gt;
&lt;td&gt;Hail_To_Reason&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;4&lt;/td&gt;
&lt;td&gt;Turn-To&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;5&lt;/td&gt;
&lt;td&gt;Royal_Charger&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;6&lt;/td&gt;
&lt;td&gt;Nearco&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;7&lt;/td&gt;
&lt;td&gt;Pharos&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;8&lt;/td&gt;
&lt;td&gt;Phalaris&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;9&lt;/td&gt;
&lt;td&gt;Polymelus&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;10&lt;/td&gt;
&lt;td&gt;Cyllene&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;11&lt;/td&gt;
&lt;td&gt;Bona_Vista&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;12&lt;/td&gt;
&lt;td&gt;Bend_Or&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;13&lt;/td&gt;
&lt;td&gt;Doncaster&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;14&lt;/td&gt;
&lt;td&gt;Stockwell&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;15&lt;/td&gt;
&lt;td&gt;The_Baron&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;16&lt;/td&gt;
&lt;td&gt;Birdcatcher&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;17&lt;/td&gt;
&lt;td&gt;Sir_Hercules&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;18&lt;/td&gt;
&lt;td&gt;Whalebone&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;19&lt;/td&gt;
&lt;td&gt;Waxy&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;20&lt;/td&gt;
&lt;td&gt;Potoooooooo&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;21&lt;/td&gt;
&lt;td&gt;Eclipse&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;22&lt;/td&gt;
&lt;td&gt;Marske&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;23&lt;/td&gt;
&lt;td&gt;Squirt&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;24&lt;/td&gt;
&lt;td&gt;Bartlet&#39;s_Childers&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;25&lt;/td&gt;
&lt;td&gt;Darley_Arabian&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
</description>
    </item>
    
    <item>
      <title>SPARQLを使用して日本語版DBPediaから有馬記念の勝ち馬の始祖を辿る</title>
      <link>/sparql-graph-thoroughbred-search.html</link>
      <pubDate>Sat, 22 Feb 2020 00:00:00 +0000</pubDate>
      <guid>/sparql-graph-thoroughbred-search.html</guid>
      <description>&lt;h2 id=&#34;heading&#34;&gt;はじめに&lt;/h2&gt;
&lt;p&gt;DBpediaはWikipediaから情報を抽出してLOD (Linked Open Data)として公開するコミュニティプロジェクトで、英語版と日本語版があります。日本語版は&lt;code&gt;ja.wikipedia.org&lt;/code&gt;からデータを抽出しています。抽出したデータは構造化データ(RDF)として格納されています。RDFストアに対してはSPARQLというクエリ言語で情報を取得することが出来ます。今回は日本語版のDBpediaで情報を取得したいと思います。&lt;/p&gt;
&lt;iframe src=&#34;//www.slideshare.net/slideshow/embed_code/key/8lHvTVasgBvWtE&#34; width=&#34;595&#34; height=&#34;485&#34; frameborder=&#34;0&#34; marginwidth=&#34;0&#34; marginheight=&#34;0&#34; scrolling=&#34;no&#34; style=&#34;border:1px solid #CCC; border-width:1px; margin-bottom:5px; max-width: 100%;&#34; allowfullscreen&gt; &lt;/iframe&gt; &lt;div style=&#34;margin-bottom:5px&#34;&gt; &lt;strong&gt; &lt;a href=&#34;//www.slideshare.net/takeda/what-isdpbedia&#34; title=&#34;DBpedia Japaneseとは？&#34; target=&#34;_blank&#34;&gt;DBpedia Japaneseとは？&lt;/a&gt; &lt;/strong&gt; from &lt;strong&gt;&lt;a href=&#34;https://www.slideshare.net/takeda&#34; target=&#34;_blank&#34;&gt;National Institute of Informatics (NII)&lt;/a&gt;&lt;/strong&gt; &lt;/div&gt;
## SPARQLエンドポイント
&lt;p&gt;DBpediaのエンドポイントはこちらになります。&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Virtuoso SPARQL Query Editor &lt;a href=&#34;http://ja.dbpedia.org/sparql&#34;&gt;http://ja.dbpedia.org/sparql&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2 id=&#34;heading-1&#34;&gt;有馬記念の勝ち馬に関する情報&lt;/h2&gt;
&lt;h3 id=&#34;heading-2&#34;&gt;プロパティを調べる&lt;/h3&gt;
&lt;p&gt;勝ち馬を軸にまずはどんなプロパティを持っているかどうかを調べてみる。&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-SQL&#34;&gt;select distinct ?p {
  {
    ?name prop-ja:wikiPageUsesTemplate template-ja:有馬記念勝ち馬.
  }

  ?name rdfs:label ?label ;
    ?p ?o .
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;image-20200222142308680.png&#34; alt=&#34;image-20200222142308680&#34; style=&#34;zoom:50%;&#34; /&gt;&lt;/p&gt;
&lt;h3 id=&#34;heading-3&#34;&gt;サンプルを確認&lt;/h3&gt;
&lt;p&gt;勝ち馬を軸にまずはどんなプロパティを持っているかのサンプル値を出力する。&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-SQL&#34;&gt;select ?p (SAMPLE(?o) AS ?sample_value)
WHERE {
  {
    ?name prop-ja:wikiPageUsesTemplate template-ja:有馬記念勝ち馬.
  }

  ?name rdfs:label ?label ;
    ?p ?o .
} order by (?p)
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;image-20200222142141557.png&#34; alt=&#34;image-20200222142141557&#34; style=&#34;zoom:50%;&#34; /&gt;&lt;/p&gt;
&lt;h3 id=&#34;heading-4&#34;&gt;血統を辿る&lt;/h3&gt;
&lt;p&gt;次に父の父の父の父・・・・・という感じで血統を調べていき、どこまで辿れるかやってみます。&lt;/p&gt;
&lt;p&gt;RDBMSに格納されているデータで同じように特定の馬の父の父の父とした場合、同じテーブルに格納されている値をサブクエリ(副問合せ)で結合して取得すると思いますが、おそらく数世代先の馬を調べる時に性能限界が来ると思います。何度もjoinする必要があるので。&lt;/p&gt;
&lt;p&gt;一方、RDFストアやSPARQLクエリは関係性を抽出することに優れた言語のため、特にリレーション抽出対象が増えたとしてもクエリの性能に影響を与えません。&lt;/p&gt;
&lt;p&gt;ちなみに競馬で走る馬はサラブレッドと呼ばれますが、血統を辿ると全て3頭の馬(ダーレーアラビアン、ゴドルフィンアラビアン、バイアリーターク)にさかのぼると言います。&lt;strong&gt;&lt;u&gt;WikipediaやDBPediaのデータが正しければ&lt;/u&gt;&lt;/strong&gt;おそらくこの3頭のどれかには辿り付くはずです。&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;3大始祖と世界の血統：サラブレッド講座　JRA &lt;a href=&#34;http://www.jra.go.jp/kouza/thoroughbred/founder/&#34;&gt;http://www.jra.go.jp/kouza/thoroughbred/founder/&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h4 id=&#34;1&#34;&gt;第1世代&lt;/h4&gt;
&lt;p&gt;まずは勝ち馬の父を調べてみる。&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-SQL&#34;&gt;select distinct ?parent_f_name (count(?parent_f_name) AS ?count) {
  {
    ?name prop-ja:wikiPageUsesTemplate template-ja:有馬記念勝ち馬.
  }

  ?name rdfs:label ?label ;
    prop-ja:父 ?parent_f_name .
} ORDER BY DESC(?count)
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;image-20200222142450812.png&#34; alt=&#34;image-20200222142450812&#34; style=&#34;zoom:50%;&#34; /&gt;&lt;/p&gt;
&lt;h4 id=&#34;2&#34;&gt;第2世代&lt;/h4&gt;
&lt;p&gt;勝ち馬の父の父を調べてみる&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-SQL&#34;&gt;select distinct ?parent_f_f_name (count(?parent_f_f_name) AS ?count) {
  {
    ?name prop-ja:wikiPageUsesTemplate template-ja:有馬記念勝ち馬.
  }

  ?name rdfs:label ?label ;
    prop-ja:父 ?parent_f_name .
   ?parent_f_name prop-ja:父 ?parent_f_f_name .
} ORDER BY DESC(?count)
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;image-20200222144157168.png&#34; alt=&#34;image-20200222144157168&#34; style=&#34;zoom:50%;&#34; /&gt;&lt;/p&gt;
&lt;h4 id=&#34;18&#34;&gt;第18世代&lt;/h4&gt;
&lt;p&gt;一気に飛んで第18世代です。こんな感じでどこまで辿れるか試してみます。&lt;code&gt;ホエルボーン&lt;/code&gt;は&lt;code&gt;1807年-1831年&lt;/code&gt;のイギリス馬です。現時点で&lt;code&gt;18世代&lt;/code&gt;遡っています。&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-SQL&#34;&gt;select distinct ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name (count(?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name) AS ?count) {
  {
    ?name prop-ja:wikiPageUsesTemplate template-ja:有馬記念勝ち馬.
  }

  ?name rdfs:label ?label ;
    prop-ja:父 ?parent_f_name .
   ?parent_f_name prop-ja:父 ?parent_f_f_name .
   ?parent_f_f_name prop-ja:父 ?parent_f_f_f_name .
   ?parent_f_f_f_name prop-ja:父 ?parent_f_f_f_f_name .
   ?parent_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
} ORDER BY DESC(?count)
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;image-20200222144259529.png&#34; alt=&#34;image-20200222144259529&#34; style=&#34;zoom:50%;&#34; /&gt;&lt;/p&gt;
&lt;h4 id=&#34;19&#34;&gt;第19世代&lt;/h4&gt;
&lt;pre&gt;&lt;code class=&#34;language-SQL&#34;&gt;
select distinct ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name (count(?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name) AS ?count) {
  {
    ?name prop-ja:wikiPageUsesTemplate template-ja:有馬記念勝ち馬.
  }

  ?name rdfs:label ?label ;
    prop-ja:父 ?parent_f_name .
   ?parent_f_name prop-ja:父 ?parent_f_f_name .
   ?parent_f_f_name prop-ja:父 ?parent_f_f_f_name .
   ?parent_f_f_f_name prop-ja:父 ?parent_f_f_f_f_name .
   ?parent_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
} ORDER BY DESC(?count)

&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;image-20200222145756017.png&#34; alt=&#34;image-20200222145756017&#34; style=&#34;zoom:50%;&#34; /&gt;&lt;/p&gt;
&lt;h4 id=&#34;21&#34;&gt;第21世代&lt;/h4&gt;
&lt;p&gt;21世代まで遡ってみると、ワクシーという一頭に絞られてしまいました。ホエールボーンの父がワクシーです。&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-SQL&#34;&gt;select distinct ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name (count(?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name) AS ?count) {
  {
    ?name prop-ja:wikiPageUsesTemplate template-ja:有馬記念勝ち馬.
  }

  ?name rdfs:label ?label ;
    prop-ja:父 ?parent_f_name .
   ?parent_f_name prop-ja:父 ?parent_f_f_name .
   ?parent_f_f_name prop-ja:父 ?parent_f_f_f_name .
   ?parent_f_f_f_name prop-ja:父 ?parent_f_f_f_f_name .
   ?parent_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
} ORDER BY DESC(?count)
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;image-20200222150544445.png&#34; alt=&#34;image-20200222150544445&#34; style=&#34;zoom:50%;&#34; /&gt;&lt;/p&gt;
&lt;h4 id=&#34;22&#34;&gt;第22世代&lt;/h4&gt;
&lt;p&gt;このワクシーの親を調べようとしたら出てきませんでした。&lt;a href=&#34;https://ja.wikipedia.org/wiki/%E3%83%9B%E3%82%A8%E3%83%BC%E3%83%AB%E3%83%9C%E3%83%BC%E3%83%B3&#34;&gt;ホエールボーン&lt;/a&gt;の父が「&lt;a href=&#34;https://ja.wikipedia.org/wiki/%E3%83%AF%E3%82%AF%E3%82%B7%E3%83%BC&#34;&gt;ワクシー&lt;/a&gt;」なのですが、実際のWikipediaのページは「https://ja.wikipedia.org/wiki/ワキシー」となっています。「ワクシー」と「ワキシー」でURIが異なるためこれ以上辿れないのだと推測します。&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-SQL&#34;&gt;select distinct ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name (count(?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name) AS ?count) {
  {
    ?name prop-ja:wikiPageUsesTemplate template-ja:有馬記念勝ち馬.
  }

  ?name rdfs:label ?label ;
    prop-ja:父 ?parent_f_name .
   ?parent_f_name prop-ja:父 ?parent_f_f_name .
   ?parent_f_f_name prop-ja:父 ?parent_f_f_f_name .
   ?parent_f_f_f_name prop-ja:父 ?parent_f_f_f_f_name .
   ?parent_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
   ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name prop-ja:父 ?parent_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_f_name .
} ORDER BY DESC(?count)
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;image-20200222150814920.png&#34; alt=&#34;image-20200222150814920&#34;&gt;&lt;/p&gt;
&lt;h3 id=&#34;heading-5&#34;&gt;終わりに&lt;/h3&gt;
&lt;p&gt;次は英語版でやってみます。&lt;/p&gt;
&lt;p&gt;今回は全て父を辿りましたが、他のプロパティを組み合わせて分析したいなと思いました。競馬の分析用途に自前のRDFストアを構築するということもやってみたいと思いました。&lt;/p&gt;
</description>
    </item>
    
    <item>
      <title>Amazon Neptuneのインスタンス作成からデータロード、クエリ実行までやってみる</title>
      <link>/aws-neptune-create-instance-execute-query-try.html</link>
      <pubDate>Tue, 28 Jan 2020 00:00:00 +0000</pubDate>
      <guid>/aws-neptune-create-instance-execute-query-try.html</guid>
      <description>&lt;h3 id=&#34;heading&#34;&gt;はじめに&lt;/h3&gt;
&lt;p&gt;AWSの完全マネージド型のグラフデータベースサービスであるNeptuneを触ってみようと思う。インスタンス作成から&lt;code&gt;RDF&lt;/code&gt;形式のデータロード、及び&lt;code&gt;SPARQL&lt;/code&gt;を使用して単純なクエリ発行までやってみる。&lt;/p&gt;
&lt;p&gt;グラフデータベースとは？Amazon Neptuneとは？については別記事でまとめたい。&lt;/p&gt;
&lt;p&gt;下記stepで実施する。&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;インスタンスの作成&lt;/li&gt;
&lt;li&gt;IAMロール作成、ロールのNeptuneへのアタッチ、S3VPCエンドポイントの設定&lt;/li&gt;
&lt;li&gt;S3からデータのロード&lt;/li&gt;
&lt;li&gt;RDF4J コンソール、HTTP REST エンドポイントを使用してロードしたデータの確認&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;前提条件&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;VPCやS3の事前作成&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&#34;heading-1&#34;&gt;インスタンスの作成&lt;/h3&gt;
&lt;h4 id=&#34;heading-2&#34;&gt;「データベースの作成」を選択&lt;/h4&gt;
&lt;p&gt;&lt;img src=&#34;image-20200128161750382.png&#34; alt=&#34;image-20200128161750382&#34;&gt;&lt;/p&gt;
&lt;h4 id=&#34;db&#34;&gt;「DB詳細の指定」を入力。&lt;/h4&gt;
&lt;p&gt;今回は現時点の最新のバージョンである「Neptune 1.0.2.1.R4」を指定。インスタンス作成後のMulti-AZへの変更は現段階では出来ないので必要に応じてこのタイミングで選択する。&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image-20200128161848792.png&#34; alt=&#34;image-20200128161848792&#34;&gt;&lt;/p&gt;
&lt;h4 id=&#34;heading-3&#34;&gt;続きを入力。&lt;/h4&gt;
&lt;p&gt;RDSやAuroraと同じような入力項目。&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image-20200128162140347.png&#34; alt=&#34;image-20200128162140347&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image-20200128162149794.png&#34; alt=&#34;image-20200128162149794&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image-20200128162200135.png&#34; alt=&#34;image-20200128162200135&#34;&gt;&lt;/p&gt;
&lt;p&gt;「データベースの作成」ボタンをクリック後に作成が始まるので少々待つ。&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image-20200128162219388.png&#34; alt=&#34;image-20200128162219388&#34;&gt;&lt;/p&gt;
&lt;p&gt;大体5分～10分くらいで作成は完了した。&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image-20200128162946898.png&#34; alt=&#34;image-20200128162946898&#34;&gt;&lt;/p&gt;
&lt;h3 id=&#34;iams3vpc&#34;&gt;「IAMロールとS3VPCエンドポイントの設定」&lt;/h3&gt;
&lt;p&gt;データロードのための下準備としてIAMロールとS3 VPCエンドポイントの設定を行う。&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;前提条件: IAM ロールと Amazon S3 アクセス - Amazon Neptune &lt;a href=&#34;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/bulk-load-tutorial-IAM.html&#34;&gt;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/bulk-load-tutorial-IAM.html&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;IAMの画面から「ロールの作成」を選択&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image-20200128163143004.png&#34; alt=&#34;image-20200128163143004&#34;&gt;&lt;/p&gt;
&lt;p&gt;S3を選択&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image-20200128163255012.png&#34; alt=&#34;image-20200128163255012&#34;&gt;&lt;/p&gt;
&lt;p&gt;「&lt;code&gt;AmazonS3ReadOnlyAccess&lt;/code&gt;」を選択してポリシーをアタッチする。&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image-20200128171213697.png&#34; alt=&#34;image-20200128171213697&#34;&gt;&lt;/p&gt;
&lt;p&gt;必要に応じて&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image-20200128163425236.png&#34; alt=&#34;image-20200128163425236&#34;&gt;&lt;/p&gt;
&lt;p&gt;ロール名は「NeptuneLoadFromS3」とした。&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image-20200128163502048.png&#34; alt=&#34;image-20200128163502048&#34;&gt;&lt;/p&gt;
&lt;p&gt;作成したロールの画面に移動する。&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image-20200128163556778.png&#34; alt=&#34;image-20200128163556778&#34;&gt;&lt;/p&gt;
&lt;p&gt;「信頼関係」-「信頼関係の編集」へと移動して下記を上書きして貼り付ける。&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image-20200128163702608.png&#34; alt=&#34;image-20200128163702608&#34;&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-json&#34;&gt;{
  &amp;quot;Version&amp;quot;: &amp;quot;2012-10-17&amp;quot;,
  &amp;quot;Statement&amp;quot;: [
    {
      &amp;quot;Sid&amp;quot;: &amp;quot;&amp;quot;,
      &amp;quot;Effect&amp;quot;: &amp;quot;Allow&amp;quot;,
      &amp;quot;Principal&amp;quot;: {
        &amp;quot;Service&amp;quot;: [
          &amp;quot;rds.amazonaws.com&amp;quot;
        ]
      },
      &amp;quot;Action&amp;quot;: &amp;quot;sts:AssumeRole&amp;quot;
    }
  ]
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;image-20200128163744771.png&#34; alt=&#34;image-20200128163744771&#34;&gt;&lt;/p&gt;
&lt;h3 id=&#34;amazon-neptune--iam-&#34;&gt;「Amazon Neptune クラスターに IAM ロール」を追加する&lt;/h3&gt;
&lt;p&gt;Neptuneのクラスタに移動して「IAMロールの管理」を選択。&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image-20200128163850955.png&#34; alt=&#34;image-20200128163850955&#34;&gt;&lt;/p&gt;
&lt;p&gt;先程作成したIAMロール(&lt;code&gt;NeptuneLoadFromS3&lt;/code&gt;)を追加する。&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image-20200128163932718.png&#34; alt=&#34;image-20200128163932718&#34;&gt;&lt;/p&gt;
&lt;h3 id=&#34;s3-vpc&#34;&gt;S3 VPCエンドポイントを作成&lt;/h3&gt;
&lt;p&gt;S3からNeptuneにロードする際にVPCエンドポイントが必要なのでVPCエンドポイントを設定する。&lt;/p&gt;
&lt;p&gt;エンドポイントの作成画面で「com.amazonaws.ap-northeast-1.s3」を選択する。（今回はTokyoリージョンなので&lt;code&gt;ap-northeast-1&lt;/code&gt;だが、他リージョンの場合はリージョン名が異なる。）&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image-20200128164302433.png&#34; alt=&#34;image-20200128164302433&#34;&gt;&lt;/p&gt;
&lt;p&gt;VPCやルートテーブルを指定する&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image-20200128164436298.png&#34; alt=&#34;image-20200128164436298&#34;&gt;&lt;/p&gt;
&lt;h3 id=&#34;s3neptune&#34;&gt;S3からNeptuneへのデータのロード&lt;/h3&gt;
&lt;p&gt;ここまででS3からNeptuneへロードする準備が出来た。ロードするデータは &lt;a href=&#34;http://rdf.geospecies.org&#34;&gt;http://rdf.geospecies.org&lt;/a&gt; のデータを使用することにする。rdfxml形式のRDFデータのサンプルをS3の所定のバケットにアップロード&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;[ec2-user@bastin nep-tool]$ curl -O http://rdf.geospecies.org/geospecies.rdf.gz
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100 8891k  100 8891k    0     0  3405k      0  0:00:02  0:00:02 --:--:-- 3404k
[ec2-user@bastin nep-tool]$ 
[ec2-user@bastin nep-tool]$ ls -l geospecies.rdf.gz
-rw-rw-r-- 1 ec2-user ec2-user 9105109 Jan 28 08:16 geospecies.rdf.gz
[ec2-user@bastin nep-tool]$ aws s3 cp geospecies.rdf.gz s3://nep-s3-xxxx/
upload: ./geospecies.rdf.gz to s3://nep-s3-xxxx/geospecies.rdf.gz 
[ec2-user@bastin nep-tool]$   
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;下記コマンドでデータをロードする。&lt;code&gt;エンドポイント&lt;/code&gt;、&lt;code&gt;source&lt;/code&gt;、&lt;code&gt;format&lt;/code&gt;、&lt;code&gt;iamRoleArn&lt;/code&gt;を必要に応じて変更が必要。&lt;/p&gt;
&lt;p&gt;RDFの場合のformatは他にも&lt;code&gt;turtle&lt;/code&gt;や&lt;code&gt;ntriples&lt;/code&gt;なども選択可能。&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;ロードデータ形式 - Amazon Neptune &lt;a href=&#34;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/bulk-load-tutorial-format.html&#34;&gt;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/bulk-load-tutorial-format.html&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;curl -X POST \
    -H &#39;Content-Type: application/json&#39; \
    https://neptest.xxxxxxxxxxxx.ap-northeast-1.neptune.amazonaws.com:8182/loader -d &#39;
    {
      &amp;quot;source&amp;quot; : &amp;quot;s3://nep-s3-xxxx/geospecies.rdf.gz&amp;quot;, 
      &amp;quot;format&amp;quot; : &amp;quot;rdfxml&amp;quot;,
      &amp;quot;iamRoleArn&amp;quot; : &amp;quot;arn:aws:iam::xxxxxxxxx:role/NeptuneLoadFromS3&amp;quot;,
      &amp;quot;region&amp;quot; : &amp;quot;ap-northeast-1&amp;quot;,
      &amp;quot;failOnError&amp;quot; : &amp;quot;FALSE&amp;quot;,
      &amp;quot;parallelism&amp;quot; : &amp;quot;HIGH&amp;quot;
    }&#39;
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;実行後、下記が表示される。状況確認に&lt;code&gt;loadId&lt;/code&gt;が必要なので控えておく。&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;{
    &amp;quot;status&amp;quot; : &amp;quot;200 OK&amp;quot;,
    &amp;quot;payload&amp;quot; : {
        &amp;quot;loadId&amp;quot; : &amp;quot;eff1268f-17ab-473a-b845-c2d91a317c01&amp;quot;
    }

&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;データロードのステータス確認。先程取得した&lt;code&gt;loadId&lt;/code&gt;を指定する&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;curl -G &#39;https://neptest.xxxxxxxxxxxx.ap-northeast-1.neptune.amazonaws.com:8182/loader/eff1268f-17ab-473a-b845-c2d91a317c01&#39;
&lt;/code&gt;&lt;/pre&gt;
&lt;h5 id=&#34;heading-4&#34;&gt;進行中の出力&lt;/h5&gt;
&lt;pre&gt;&lt;code class=&#34;language-json&#34;&gt;[ec2-user@bastin nep-tool]$ curl -G &#39;https://neptest.xxxxxxxxxxxx.ap-northeast-1.neptune.amazonaws.com:8182/loader/eff1268f-17ab-473a-b845-c2d91a317c01&#39;
{
    &amp;quot;status&amp;quot; : &amp;quot;200 OK&amp;quot;,
    &amp;quot;payload&amp;quot; : {
        &amp;quot;feedCount&amp;quot; : [
            {
                &amp;quot;LOAD_IN_PROGRESS&amp;quot; : 1
            }
        ],
        &amp;quot;overallStatus&amp;quot; : {
            &amp;quot;fullUri&amp;quot; : &amp;quot;s3://nep-s3-xxxx/geospecies.rdf.gz&amp;quot;,
            &amp;quot;runNumber&amp;quot; : 1,
            &amp;quot;retryNumber&amp;quot; : 0,
            &amp;quot;status&amp;quot; : &amp;quot;LOAD_IN_PROGRESS&amp;quot;,
            &amp;quot;totalTimeSpent&amp;quot; : 148,
            &amp;quot;startTime&amp;quot; : 1580199498,
            &amp;quot;totalRecords&amp;quot; : 2130000,
            &amp;quot;totalDuplicates&amp;quot; : 0,
            &amp;quot;parsingErrors&amp;quot; : 0,
            &amp;quot;datatypeMismatchErrors&amp;quot; : 0,
            &amp;quot;insertErrors&amp;quot; : 0
        }
    }
}
&lt;/code&gt;&lt;/pre&gt;
&lt;h5 id=&#34;heading-5&#34;&gt;ロード完了の出力&lt;/h5&gt;
&lt;pre&gt;&lt;code class=&#34;language-json&#34;&gt;[ec2-user@bastin nep-tool]$ curl -G &#39;https://neptest.xxxxxxxxxxxx.ap-northeast-1.neptune.amazonaws.com:8182/loader/eff1268f-17ab-473a-b845-c2d91a317c01&#39;
{
    &amp;quot;status&amp;quot; : &amp;quot;200 OK&amp;quot;,
    &amp;quot;payload&amp;quot; : {
        &amp;quot;feedCount&amp;quot; : [
            {
                &amp;quot;LOAD_COMPLETED&amp;quot; : 1
            }
        ],
        &amp;quot;overallStatus&amp;quot; : {
            &amp;quot;fullUri&amp;quot; : &amp;quot;s3://nep-s3-xxxx/geospecies.rdf.gz&amp;quot;,
            &amp;quot;runNumber&amp;quot; : 1,
            &amp;quot;retryNumber&amp;quot; : 0,
            &amp;quot;status&amp;quot; : &amp;quot;LOAD_COMPLETED&amp;quot;,
            &amp;quot;totalTimeSpent&amp;quot; : 149,
            &amp;quot;startTime&amp;quot; : 1580199498,
            &amp;quot;totalRecords&amp;quot; : 2201532,
            &amp;quot;totalDuplicates&amp;quot; : 0,
            &amp;quot;parsingErrors&amp;quot; : 0,
            &amp;quot;datatypeMismatchErrors&amp;quot; : 0,
            &amp;quot;insertErrors&amp;quot; : 0
        }
    }
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;各フィールドの説明は下記の通り。今回の例では「&lt;strong&gt;&lt;u&gt;2,201,532&lt;/u&gt;&lt;/strong&gt;」行のロードに「&lt;strong&gt;&lt;u&gt;149&lt;/u&gt;&lt;/strong&gt;」秒掛かっていることがわかる。&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Neptune Loader Get-Status API - Amazon Neptune &lt;a href=&#34;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/load-api-reference-status.html&#34;&gt;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/load-api-reference-status.html&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;table&gt;
&lt;thead&gt;
&lt;tr&gt;
&lt;th&gt;フィールド&lt;/th&gt;
&lt;th&gt;説明&lt;/th&gt;
&lt;/tr&gt;
&lt;/thead&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;fullUri&lt;/td&gt;
&lt;td&gt;ロードされる 1 つ以上のファイルの URI。形式: s3://bucket/key&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;runNumber&lt;/td&gt;
&lt;td&gt;このロードまたはフィードの実行数。これは、ロードが再開されると増加します。&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;retryNumber&lt;/td&gt;
&lt;td&gt;このロードまたはフィードの再試行回数。これは、ローダーがフィードまたはロードを自動的に再試行するときに増加されます。&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;status&lt;/td&gt;
&lt;td&gt;ロードあるいはフィードの返されたステータス。LOAD_COMPLETED はロードが問題なく成功したことを示します。&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;totalTimeSpent&lt;/td&gt;
&lt;td&gt;ロードまたはフィードのデータの解析や挿入に費やした時間 (秒単位)。これには、ソースファイルのリストを取得するのに費やされた時間は含まれません。&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;totalRecords&lt;/td&gt;
&lt;td&gt;ロードされた、またはロードしようとした全レコード。&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;totalDuplicates&lt;/td&gt;
&lt;td&gt;発生した重複レコードの数。&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;parsingErrors&lt;/td&gt;
&lt;td&gt;発生した解析エラーの数。&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;datatypeMismatchErrors&lt;/td&gt;
&lt;td&gt;指定されたデータとデータ型が一致しないレコードの数。&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;insertErrors&lt;/td&gt;
&lt;td&gt;エラーのために挿入できなかったレコードの数。&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;h3 id=&#34;neptune&#34;&gt;Neptuneへのクエリ発行&lt;/h3&gt;
&lt;p&gt;データロードまで出来たのでクエリを発行する。&lt;/p&gt;
&lt;h4 id=&#34;http-rest-&#34;&gt;HTTP REST エンドポイントを使用する場合&lt;/h4&gt;
&lt;blockquote&gt;
&lt;p&gt;HTTP REST エンドポイントを使用して Neptune DB インスタンスに接続する - Amazon Neptune &lt;a href=&#34;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/access-graph-sparql-http-rest.html&#34;&gt;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/access-graph-sparql-http-rest.html&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;curl -X POST --data-binary &#39;query=select ?s ?p ?o where {?s ?p ?o} limit 10&#39; https://neptest.xxxxxxxxxxxx.ap-northeast-1.neptune.amazonaws.com:8182/sparql
&lt;/code&gt;&lt;/pre&gt;
&lt;h5 id=&#34;heading-6&#34;&gt;実行結果&lt;/h5&gt;
&lt;pre&gt;&lt;code class=&#34;language-json&#34;&gt;[ec2-user@bastin nep-tool]$ curl -X POST --data-binary &#39;query=select ?s ?p ?o where {?s ?p ?o} limit 10&#39; https://neptest.xxxxxxxxxxxx.ap-northeast-1.neptune.amazonaws.com:8182/sparql
{
  &amp;quot;head&amp;quot; : {
    &amp;quot;vars&amp;quot; : [ &amp;quot;s&amp;quot;, &amp;quot;p&amp;quot;, &amp;quot;o&amp;quot; ]
  },
  &amp;quot;results&amp;quot; : {
    &amp;quot;bindings&amp;quot; : [ {
      &amp;quot;s&amp;quot; : {
        &amp;quot;type&amp;quot; : &amp;quot;uri&amp;quot;,
        &amp;quot;value&amp;quot; : &amp;quot;http://lod.geospecies.org/ses/uRtpv&amp;quot;
      },
      &amp;quot;p&amp;quot; : {
        &amp;quot;type&amp;quot; : &amp;quot;uri&amp;quot;,
        &amp;quot;value&amp;quot; : &amp;quot;http://rdf.geospecies.org/ont/geospecies#isUnexpectedIn&amp;quot;
      },
      &amp;quot;o&amp;quot; : {
        &amp;quot;type&amp;quot; : &amp;quot;uri&amp;quot;,
        &amp;quot;value&amp;quot; : &amp;quot;http://sws.geonames.org/5001836/&amp;quot;
      }
～省略～
&lt;/code&gt;&lt;/pre&gt;
&lt;h4 id=&#34;rdf4j-&#34;&gt;RDF4J コンソールを使用する場合&lt;/h4&gt;
&lt;blockquote&gt;
&lt;p&gt;RDF4J コンソールを使用して Neptune DB インスタンスに接続する - Amazon Neptune &lt;a href=&#34;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/access-graph-sparql-rdf4j-console.html&#34;&gt;https://docs.aws.amazon.com/ja_jp/neptune/latest/userguide/access-graph-sparql-rdf4j-console.html&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;a href=&#34;https://rdf4j.org/download/&#34;&gt;RDF4J のサイト&lt;/a&gt;からRDF4J SDKをダウンロード&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image-20200128173450786.png&#34; alt=&#34;image-20200128173450786&#34;&gt;&lt;/p&gt;
&lt;p&gt;特定のEC2にダウンロードしたzipファイルをアップロードする。&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;[ec2-user@bastin nep-tool]$ ls -l
total 104740
-rw-r--r-- 1 ec2-user ec2-user 98147430 Jan 25 06:16 eclipse-rdf4j-3.0.4-sdk.zip
-rw-rw-r-- 1 ec2-user ec2-user  9105109 Jan 28 08:16 geospecies.rdf.gz
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;zipファイルをunzip後に、bin配下に存在する &lt;code&gt;console.sh&lt;/code&gt;を実行する&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;[ec2-user@bastin nep-tool]$ ./eclipse-rdf4j-3.0.4/bin/console.sh
08:37:35.639 [main] DEBUG org.eclipse.rdf4j.common.platform.PlatformFactory - os.name = linux
08:37:35.652 [main] DEBUG org.eclipse.rdf4j.common.platform.PlatformFactory - Detected Posix platform
Connected to default data directory
RDF4J Console 3.0.4+47737c0

3.0.4+47737c0
Type &#39;help&#39; for help.
&amp;gt; 
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;Neptune DB インスタンス に SPARQL リポジトリを作成&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;create sparql
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;下記情報の入力を求められるので入力する。未確認だがリードレプリカを作った場合はここの「SPARQL クエリのエンドポイント」と「SPARQL 更新エンドポイント」をマスタとリードレプリカに分けるべきなのではないかと推測。&lt;/p&gt;
&lt;table&gt;
&lt;thead&gt;
&lt;tr&gt;
&lt;th&gt;変数名&lt;/th&gt;
&lt;th&gt;値&lt;/th&gt;
&lt;/tr&gt;
&lt;/thead&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;SPARQL クエリのエンドポイント&lt;/td&gt;
&lt;td&gt;https://your-neptune-endpoint:port/sparql&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;SPARQL 更新エンドポイント&lt;/td&gt;
&lt;td&gt;https://your-neptune-endpoint:port/sparql&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;ローカルリポジトリ ID [endpoint@localhost]&lt;/td&gt;
&lt;td&gt;neptune&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;リポジトリタイトル [SPARQL エンドポイントリポジトリ  @localhost]&lt;/td&gt;
&lt;td&gt;Neptune  DB instance&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;&amp;gt; create sparql
Please specify values for the following variables:
SPARQL query endpoint: https://neptest.xxxxxxxxxxxx.ap-northeast-1.neptune.amazonaws.com:8182/sparql
SPARQL update endpoint: https://neptest.xxxxxxxxxxxx.ap-northeast-1.neptune.amazonaws.com:8182/sparql
Local repository ID [endpoint@localhost]: neptune
Repository title [SPARQL endpoint repository @localhost]: Neptune DB instance

Repository created
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;Neptune インスタンスに接続する。接続後はプロンプトにローカルリポジトリ IDが表示される。&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;&amp;gt; open neptune
Opened repository &#39;neptune&#39;
neptune&amp;gt; 
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;HTTP REST エンドポイントを使用して実行した場合と同様のクエリを実行してみる。&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;language-sh&#34;&gt;neptune&amp;gt; sparql select ?s ?p ?o where {?s ?p ?o} limit 10
Evaluating SPARQL query...
+------------------------+------------------------+------------------------+
| s                      | p                      | o                      |
+------------------------+------------------------+------------------------+
| &amp;lt;http://lod.geospecies.org/ses/zJIK4&amp;gt;| &amp;lt;http://rdf.geospecies.org/ont/geospecies#hasScientificNameAuthorship&amp;gt;| &amp;quot;(LeConte, 1866)&amp;quot;^^xsd:string|
| &amp;lt;http://lod.geospecies.org/ses/zJIK4&amp;gt;| &amp;lt;http://rdf.geospecies.org/ont/geospecies#hasScientificName&amp;gt;| &amp;quot;Iphthiminus opacus (LeConte, 1866)&amp;quot;^^xsd:string|
| &amp;lt;http://lod.geospecies.org/ses/zJIK4&amp;gt;| &amp;lt;http://rdf.geospecies.org/ont/geospecies#isExpectedIn&amp;gt;| &amp;lt;http://sws.geonames.org/6255149/&amp;gt;|
| &amp;lt;http://lod.geospecies.org/ses/zJIK4&amp;gt;| &amp;lt;http://rdf.geospecies.org/ont/geospecies#isExpectedIn&amp;gt;| &amp;lt;http://sws.geonames.org/5279468/&amp;gt;|
| &amp;lt;http://lod.geospecies.org/ses/zJIK4&amp;gt;| &amp;lt;http://rdf.geospecies.org/ont/geospecies#hasNomenclaturalCode&amp;gt;| &amp;lt;http://rdf.geospecies.org/ont/geospecies#NomenclaturalCode_ICZN&amp;gt;|
| &amp;lt;http://lod.geospecies.org/ses/zJIK4&amp;gt;| &amp;lt;http://rdf.geospecies.org/ont/geospecies#isUnknownAboutIn&amp;gt;| &amp;lt;http://sws.geonames.org/4862182/&amp;gt;|
| &amp;lt;http://lod.geospecies.org/ses/zJIK4&amp;gt;| &amp;lt;http://rdf.geospecies.org/ont/geospecies#isUnknownAboutIn&amp;gt;| &amp;lt;http://sws.geonames.org/5037779/&amp;gt;|
| &amp;lt;http://lod.geospecies.org/ses/zJIK4&amp;gt;| &amp;lt;http://rdf.geospecies.org/ont/geospecies#isUnknownAboutIn&amp;gt;| &amp;lt;http://sws.geonames.org/5001836/&amp;gt;|
| &amp;lt;http://lod.geospecies.org/ses/zJIK4&amp;gt;| &amp;lt;http://rdf.geospecies.org/ont/geospecies#isUnknownAboutIn&amp;gt;| &amp;lt;http://sws.geonames.org/2635167/&amp;gt;|
| &amp;lt;http://lod.geospecies.org/ses/zJIK4&amp;gt;| &amp;lt;http://rdf.geospecies.org/ont/geospecies#hasSubfamilyName&amp;gt;| &amp;quot;Coelometopinae&amp;quot;^^xsd:string|
+------------------------+------------------------+------------------------+
10 result(s) (1268 ms)
neptune&amp;gt; 

&lt;/code&gt;&lt;/pre&gt;
</description>
    </item>
    
  </channel>
</rss>
